{"content":[{"type":"paragraph","crDate":1692623831591,"chDate":1692626054476,"text":"Der Mutation-Observer reagiert auf <i>Änderungen</i> an einem DOM-Element.\nWenn eine Änderung an dem Element vorgenommen wird, wird eine Callback-Funktion aufgerufen, die die Änderung behandelt.\nEs kann auf eine Änderung der Attribute, auf eine Änderung der Kinderliste oder auf eine Änderung der DOM-Struktur reagiert werden.\nDas Zuweisen eines Mutation-Observers erfolgt in fünf Schritten."},{"type":"subheader","crDate":1692626058620,"chDate":1692626102689,"text":"Handler"},{"type":"paragraph","crDate":1692626077635,"chDate":1692626214081,"text":"Zunächst brauchen wir eine Callback-Funktionm, die vom Observer aufgerufen werden kann.\nDer Observer übergibt eine Liste von Elementen, "},{"type":"code","crDate":1692626079147,"chDate":1692626083437,"text":"const handleMutation = entries => {\n entries.forEach(entry => {\n  console.log(entry);\n })\n}"},{"type":"subheader","crDate":1692685262807,"chDate":1692685293916,"text":"Zuweisen des Observers"},{"type":"paragraph","crDate":1692685260078,"chDate":1692685816606,"text":"\nDer Mutation-Observer enötigt zwingend ein <i>Options</i>-Objekt, in welchem u.a. gesteuert wird, auf welche Änderungen reagiert werden soll.\nDieses Options-Objekt kann die folgenden Attribute enthalten:\n<b>childList</b>\nBoolean. Bestimmt, ob auf Änderungen der Kind-Liste reagiert werden soll. Achtung: gilt nur für direkte Kinder.\n<b>subtree</b>\nBoolean, funktioniert zusammen mit <i>childList</i>. Erweitert das Verhalten von childList auf den gesamten Unterbaum.\n<b>attributes</b>\nBoolean. Reagiert auf Änderungen eines DOM-Attributes.\n<b>attributeFilter</b>\nArray, funktioniert zusammen mit <i>attributes</i>. Definiert, auf welche Attribute der Observer reagieren soll.\n<b>attributeOldValue</b>\nBoolean. Definiert, ob die alten Werte der veränderten Attribute zwischengespeichert werden sollen.\n<b>characterData</b>\nBoolean. Reagiert auf eine Veränderung des HTML-Inhaltes.\n<b>characterDataOldValue</b>\nBoolean. Defeiniert, ob der alte Textinhalt zwischengespeichert werden soll."}]}