{"content":[{"type":"paragraph","crDate":1725872062049,"chDate":1725873021100,"text":"Snippets (a.k.a. <i>Benutzercodeschnipsel</i>) sind kleine, wiederverwendbare Codeblöcke, die schnell und effizient in eine Datei eingefügt werden kann. Sie beschleunigen den Programmierprozess, indem sie das wiederholte Tippen von Standardcode überflüssig machen."},{"type":"subheader","crDate":1725872705972,"chDate":1725873024493,"text":"JSON-Code"},{"type":"paragraph","crDate":1725873026419,"chDate":1725873969788,"text":"Snippets werden in Form von JSON-Dateien abgelegt. Für jede Sprache kann eine JSON-Datei angelegt werden.\nEine Snippet-Datei wird auf dem folgenden Wege geöffnet:<ol><li>Menü -> File -> Preferences -> Configure User Snippets</li>\n<li>In die Texteingabe eine beliebige Sprache eingeben (z.B. CSS)</li>\n<li>Aus der Auswahl die gewünschte Sprache wählen.</li>\n</ol>"},{"type":"image","crDate":1725872083006,"chDate":1725872083006,"subtext":"Menü-Eintrag der Snippets","filename":"6bd38305969a1c2be07fbbe02.jpg","width":"400"},{"type":"paragraph","crDate":1725873973100,"chDate":1725874892628,"text":"Die JSON-Datei ist aufgebaut als Objekt, in dem jedes Snippet als eigenes Attribut aufgeführt ist.\nJedes Snippet-Objekt ist mit einem freien Namen belegt, der bis auf die Wiedererkennung keinen weiteren Zweck hat.\nIm Objekt sind bis zu drei Attribute aufgeführt:<ul>\n<li><b>prefix</b><br>Dieser String wird im Programmierprozess erkannt und das passende Snippet angezeigt.</li>\n<li><b>body</b><br>Dies ist der Text, der bei Auswahl des Snippet eingetragen wird..</li>\n<li><b>description</b><br>Eine optionale Beschreibung des Snippets</li>\n</ul>\nPrefix und Description sind relativ klar einfache Strings, die angezeigt werden.\nBody hat ein paar Eigenheiten, die man kennen sollte, um die Snippets zu manipulieren.\n<ul><li>Body ist als Array anzulegen. Jede Codezeile wird als eigener Array-Slot angelegt.</li>\n<li>Mit \\t kann ein Tabulator eingefügt werden.</li>\n<li>Mit \\n kann eine neue Zeile eingefügt werden</li>\n<li>Mit $1, $2, $3, etc. können Marker eingefügt werden. Direkt nach dem Einfügen des Snippets wird der Textcursor automatisch auf dem $1-Marker positioniert. Mit der Tabulator-Taste können diese Marker dann durchgeschaltet werden </li>\n</ul>"},{"type":"code","crDate":1725874094200,"chDate":1725874273154,"text":"{\n \"DOM Content loaded init\": {\n  \"prefix\": \"dclInit\",\n  \"body\": [\n   \"// FUNKTIONEN\",\n   \"const init = () => {\",\n   \"\\t$1\",\n   \"}\",\n   \"\",\n   \"// INIT\",\n   \"document.addEventListener('DOMContentLoaded', init);\",\n   \"\"\n  ],\n  \"description\": \"\"\n }\n}"},{"type":"subheader","crDate":1725873444652,"chDate":1725873448870,"text":"JSON-Dateien"},{"type":"paragraph","crDate":1725872712245,"chDate":1725873583788,"text":"Nach einer Neuinstallation von VSCode kann es gewünscht sein, bestehende Snippets zu importieren.\nDer einfachste Weg ist das Kopieren der JSON-Dateien in den entsprechenden Ordner. Der Pfad zu diesem Ordner unterscheidet sich von Betriebssystem zu Betriebssystem. Der schnellste Weg, diesen Ordner zu finden ist (Windows-Version):<ol><li>Menü -> File -> Preferences -> Configure User Snippets</li>\n<li>In die Texteingabe eine beliebige Sprache eingeben (z.B. CSS)</li>\n<li>Aus der Auswahl die gewünschte Sprache wählen.\nDaraufhin wird im Snippet-Ordner ein Dummy-Datei angelegt, die nur aus Kommentaren besteht.</li>\n<li>Rechtsklick auf den Reiter der JSON-Datei und <i>Reveal in File Explorer</i></li>\n</ol>"},{"type":"image","crDate":1725872620561,"chDate":1725872620561,"filename":"6bd38305969a1c2be07fbbe03.jpg","subtext":"Öffnen des Ordners mit den JSON-Dateien","width":"400"}]}