{"content":[{"type":"subheader","crDate":1770710174850,"chDate":1770710182185,"text":"Installation"},{"type":"paragraph","crDate":1770710172948,"chDate":1770711267537,"text":"Bei der Installation von n8n ist zu beachten, dass die aktuelle Version (2.6.4) nur auf Node Version <= 24.\nFalls eine neuere Version installiert ist, empfiehlt sich ein Downgrade auf 24.Hier bietet sich das Tool NVM an."},{"type":"links","crDate":1770711269193,"chDate":1770711269193,"links":[{"title":"NVM auf GitHub","url":"https://github.com/coreybutler/nvm-windows/releases"}]},{"type":"paragraph","crDate":1770711311602,"chDate":1770711386092,"text":"Wenn das erledigt ist, kann n8n als globales Modul installiert werden:\nDie Versionsangabe ist notwendig, da bei mir sonst eine alte Version installiert wurde."},{"type":"terminal","crDate":1770711333180,"chDate":1770711347345,"text":"npm i -g n8n@2.6.4"},{"type":"paragraph","crDate":1770712812661,"chDate":1770713819489,"text":"n8n selbst läuft mit NodeJS/Javascript. Allerdings brauchen einige Knoten, die eingebunden werden können, ein lauffähiges Python.\nDaher sollte Python ggf. noch nachinstalliert und mit n8n verknüpft werden.\nBei der Installation bitte beachten, dass der Haken \"Add python.exe to PATH\" gesetzt wird, damit Python über das Terminal aufgerufen werden kann.\nHinweis: pip ist ein Paketmanager für Python, ähnlich npm für Javascript. Das pip-Paket wird automatisch gemeinsammit Python installiert."},{"type":"links","crDate":1770712883725,"chDate":1770712883725,"links":[{"title":"Download von Python","url":"https://www.python.org/downloads/"}]},{"type":"terminal","crDate":1770713747247,"chDate":1770713764884,"text":"python -m venv C:\\n8n_python_env\nC:\\n8n_python_env\\Scripts\\activate\npip install n8n"},{"type":"subheader","crDate":1770713872377,"chDate":1770713875693,"text":"Erster Start"},{"type":"paragraph","crDate":1770713631100,"chDate":1770714235147,"text":"n8n wurde als globales Modul installiert. Daher kann es im Terminal einfach mit dem Befehl <i>n8n</i> gestartet werden.\nDer Start dauert einen Augenblick, Geduld bitte. Falls nach dem Start eine Fehlermeldung kommt, dass Python3 nicht installiert ist, muss später noch eine Einstellung vorgenommen werden. n8n selbst ist davon unabhängig undsollte trotzdem funktionieren.\nNach dem Start soll im Terminal die Taste <i>o</i> (open) gedrückt werden und ein Browser öffnet die Webseite, auf der n8n läuft.\nAls erste Amtshandlung müssen wir einen neuen User anlegen."}]}