{"content":[{"type":"paragraph","crDate":1703165148440,"chDate":1713777674626,"text":"Wenn es darum geht, ein vollständiges Projekt mit Vue aufzubauen, stößt man schnell an die Grenzen dessen, was mit der reinen Einbindung von Vue erreicht werden kann. Schnell kommt der Wunsch nach einem Komponenten-Konzept auf, um die App zu gestalten.\nUm dem zu begegnen, muss das Projekt auf andere Weise aufgezogen werden, nämlich mithilfer der Vue-CLI.\nCLI steht für <i>Command Line Interface</i>. Es ist ein Programm, das im Terminal ausgeführt wird und das Anlegen und Verwalten von Vue-Projekten erlaubt.\nDas vue CLI muss vor der Verwendung über <i>npm</i> installiert werden."},{"type":"terminal","crDate":1703165623755,"chDate":1703165647093,"text":"npm i -g @vue/cli"},{"type":"paragraph","crDate":1703165680361,"chDate":1703166637444,"text":"Wenn das erledigt ist, kann das CLI verwendet werden. \nDer Befehl <i>vue</i> sollte eine Liste der Möglichkeiten öffnen. Falls dies nicht funktioniert, sollte die Node-Eingabeaufforderung verwendet werden. Diese hat schon voreingestellte Umgebungsvariablen, wodurch das Ausführen globaler Module erleichtert wird."},{"type":"terminal","crDate":1703166738396,"chDate":1703169376060,"text":"vue\nUsage: vue <command> [options]\n\nOptions:\n  -V, --version                              \n  -h, --help                                 \n\nCommands:\n  create [options] <app-name>                \n  add [options] <plugin> [pluginOptions]     \n  invoke [options] <plugin> [pluginOptions]  \n  inspect [options] [paths...]               \n  serve                                      \n  build                                      \n  ui [options]                               \n  init [options] <template> <app-name>       \n                                             \n  config [options] [value]                   \n  outdated [options]                         \n  upgrade [options] [plugin-name]            \n  migrate [options] [plugin-name]            \n  info                                       \n  help [command]                             \n\n  Run vue <command> --help for detailed usage of given command."},{"type":"paragraph","crDate":1703166830404,"chDate":1703167930931,"text":"Um nun ein Projekt anzulegen, wird der folgende Befehl aufgerufen.\nDieser legt einen Ordner mit dem Namen des Projektes an und erzeugt darin die Struktur, um eine App mit <i>Single File Components</i> zu erstellen."},{"type":"terminal","crDate":1703167783782,"chDate":1703167869982,"text":"vue create myapp"}]}