{"content":[{"type":"paragraph","crDate":1683292136880,"chDate":1693389118771,"text":"Vue.js ist ein clientseitiges Framework zum Erstellen von <i>Single-Page-Applications</i>. Es kann auch in Multipage-Webseiten für einzelne Abschnitte verwendet werden. Eine Besonderheit gegenüber z.B. React ist, dass Vue leicht in bestehende Projekte integriert werden kann.\nVue.js ist ein relativ junges Framework, das 2014 von Evan You veröffentlicht wurde. Es hat sich schnell zu einem der beliebtesten JavaScript-Frameworks entwickelt.\nVue.js ist relativ leicht zu erlernen und zu verwenden. Es bietet eine Reihe von Funktionen, die die Entwicklung von leistungsstarken und interaktiven Webanwendungen erleichtern."},{"type":"paragraph","crDate":1693389142657,"chDate":1693391433741,"text":"In diesem Abschnitt soll zunächst an einfachen Beispielen die grundsätzliche Funktionalität von Vue besprochen werden.\nDann soll gezeigt werden, wie mit Vue eine professionellere Umgebung mit <i>Single-File-Components</i> aufgezogen werden kann."},{"type":"subheader","crDate":1693391521007,"chDate":1693391524823,"text":"Einbinden"},{"type":"paragraph","crDate":1693391529223,"chDate":1698235538981,"text":"Laut Quickstartguide von Vue soll das Framework per CDN eingebunden werden.\nIch bevorzuge es, das Framework zunächst über den Link unten herunterzuladen und dann lokal einzubinden.\nDann wird mit der importierten <i>createApp()</i>-Methode das Vue-App-Objekt erzeugt. Dieses kann verschiedene Argumente übernehmen.\nSchließlich wird die App mit einem DOM-Element verknüpft. Als Verknüpfung wird der mount()-Methode einfach ein CSS-Selector übergeben."},{"type":"code","crDate":1693392260154,"chDate":1693392354228,"text":"import { createApp } from './vue.esm-browser.js';\n\n// eine neue App erzeugen \nconst myApp = createApp();\n            \n// App mit einem DOM-Element verknüpfen\nmyApp.mount('#app');"},{"type":"links","crDate":1698233197526,"chDate":1698233197526,"links":[{"title":"Quickstart Guide","url":"https://vuejs.org/guide/quick-start.html"},{"title":"Download von Vue","url":"https://unpkg.com/vue@3/dist/vue.esm-browser.js"}]}]}