{"content":[{"type":"subheader","crDate":1706513240174,"chDate":1706513242485,"text":"Bun"},{"type":"paragraph","crDate":1706513247318,"chDate":1706515520811,"text":"Bun wurde in Zig statt in C entwickelt. Diese Sprache ist enger am System und macht Zig im Vergleich zu NodeJS etwas fünfmal schneller. Node-Projekte können ohne großen Aufwand auch auf Bun übertragen werden. \nBun bietet einen <i>Paketmanager</i> ähnlich wie npm, einen <i>Bundler</i>, native Unterstützung von <i>JSX</i> und <i>TS</i>, ein sehr umfangreiches Toolset mit Testumgebung und mehr.\nBun wurde von von Entwickler:innen entwickelt, die schon viele Jahre mit Node gearbeitet haben und damit umfangreiche Erfahrung mitbringen. Vor allem Erfahrung damit, wass besser kann und besser muss.\nEs gibt aber auch ein paar Wermutstropfen: Bun ist noch sehr jung (aktuell V1.0) und ist vor allem für Linux verfügbar. Für Windows gibt es (zur Zeit) nur eine eingeschränkte Version.\nDie verwendete Sprache Zig ist relativ wenig verbreitet und es gibt dadurch nur wenige Entwickler:innen, die an der Codebase arbeiten. "},{"type":"links","crDate":1706513477316,"chDate":1706513477316,"links":[{"title":"Offizielle Seite","url":"https://bun.sh/"}]},{"type":"subheader","crDate":1706513234777,"chDate":1706513237213,"text":"Deno"},{"type":"paragraph","crDate":1706520833852,"chDate":1706536778215,"text":"Deno ist eine Alternative zu Node, die manches besser macht als Node.\n<b>Eingebaute Tools:</b> Deno wird direkt mit einigen praktischen Tools ausgeliefert, was es sehr attraktiv macht. Es hat beispielsweise einen eingebauten Code-Linter, um Bugs und Code-Verfall zu vermeiden, und bietet einen Test-Runner und Assertion-Bibliotheken als Teil der Laufzeit und Standardbibliothek.\n<b>Sicherheit:</b> Ein entscheidender Vorteil von Deno gegenüber Node.js ist die höhere Sicherheit. Deno repliziert das Berechtigungsmodell des Browsers in einer Sandbox-Umgebung, was bedeutet, dass jede Aktion auf Ihrem System Ihre explizite Erlaubnis benötigt. In Node.js gibt es nichts, was eine Node.js-App davon abhält, zum Beispiel Ihre SSH-Keys abzugreifen und sie an einen Server weiterzuleiten.\n<b>Weniger Abhängigkeiten:</b> Das Ökosystem rund um Deno kommt allgemein mit viel weniger Abhängigkeiten aus, was ein gutes Gefühl gibt. Die Deno-Standardmodule werden vom Core-Deno-Team geprüft, was zusätzliche Sicherheit bietet.\nEs ist jedoch wichtig zu beachten, dass Deno auch einige neue Herausforderungen mit sich bringt. Während es in Node.js seit über 10 Jahren etablierte Vorgehensweisen und bewährte Ansätze gibt, ist in Deno quasi alles neu. Daher ist ein Wechsel zu Deno nicht immer ratsam ist. Es ist auch unwahrscheinlich, dass Deno Node.js in absehbarer Zeit vollständig ersetzen wird, da Node.js sehr gut und populär ist und de facto ein Standard in der Javascript-Welt ist. Dennoch bietet Deno dank seiner Vorteile und hohen Produktivität eine attraktive Alternative für viele Open-Source- und Startup-Projekte."},{"type":"links","crDate":1706536903352,"chDate":1706536903352,"links":[{"title":"Offizielle Webseite","url":"https://deno.com/"},{"title":"Dev Insider","url":"https://www.dev-insider.de/deno-gegen-nodejs-a-aef637b700956b08b421ed2034b8d511/"},{"title":"T3N","url":"https://t3n.de/magazin/besser-als-nodejs-was-deno-vom-249863/"}]}]}