{"content":[{"type":"paragraph","crDate":1685011674231,"chDate":1685015846860,"text":"\nDie Benennung einer Variablen ist nicht so einfach wie es zunächst klingt.\nEin Variablenname sollte einigen Vorgaben genügen:\n<ul>\n<li>Er sollte \"sprechend\" sein, d.h. aus dem Namen sollte der Zweck der Variable ersichtlich sein.</li>\n<li>Er sollte nicht zu lang sein, da der Variablenname ständig geschrieben werden muss.</li>\n<li>Er sollte keine geschützten Begriffe verwenden (body, list, name, etc.)</li>\n<li>Er darf keine Sonderzeichen wie Leerzeichen, Komma, etc enthalten</li>\n<li>Er darf nicht mit einer Zahl beginnen.</li>\n</ul>"},{"type":"subheader","crDate":1685015664389,"chDate":1685015857918,"text":"Schreibweise"},{"type":"paragraph","crDate":1685015662989,"chDate":1685016982434,"text":"Es gibt verschiedene Möglichkeiten, Variablennamen zu schreiben. Sie werden zu verschiedenen Zwecken verwendet und tragen viele Namen.\nDie drei gängigsten Schreibweisen sind:\n<ul>\n<li><b>meineCooleVariable</b>\nInner Caps, Lower Camel Case, Lower Camel Caps, Dromedary Case\nJedes alleinstehende Wort wird mit einem Großbuchstaben begonnen, unabhängig von der Grammatik. Der erste Buchstabe der Variablen bleibt klein geschrieben.\nIn JS wird diese Schreibweise für alle normalen Variablen und Funktionen verwendet.\n</li>\n<li><b>MeineCooleVariable</b>\nPascal Case, Upper Camel Case, Upper Camel Caps\nJedes alleinstehende Wort wird mit einem Großbuchstaben begonnen, unabhängig von der Grammatik. Der erste Buchstabe der Variablen wird groß geschrieben\nIn JS wird diese Schreibweise Konstruktoren, Klassen und Factories verwendet\n</li>\n<li><b>MEINE_COOLE_VARIABLE</b>\nScreaming Snake, \nAlle Buchstaben werden groß geschrieben. Alle alleinstehenden Worte werden mit einem Underscore getrennt.\nIn JS wird diese Schreibweise Konstruktoren, Klassen und Factories verwendet\n</li>\n</ul>"},{"type":"links","crDate":1685015768341,"chDate":1685015768341,"links":[{"title":"readLearnCode.com","url":"https://readlearncode.com/code-and-stuff/clean-code-variables/"},{"title":"Ungarische Notation","url":"https://de.wikipedia.org/wiki/Ungarische_Notation"}]}]}