{"content":[{"type":"subheader","crDate":1715167683721,"chDate":1715167685823,"text":"ECMA"},{"type":"paragraph","crDate":1715167680488,"chDate":1715170882058,"text":"Die ECMA (European Computer Manufacturers Association) ist eine Vereinigung von Computerherstellern wie Apple, Bloomberg, Google, Huawei, IBM, Indeed, Inc., AliBaba oder Meta.\nSie wurde 1961 gegründet und hat ihren Sitz in Genf, Schweiz. Die ECMA entwickelt und veröffentlicht Standards für verschiedene Technologien.\nBeispielsweise:\n<ul>\n<li>Holographic Data Storage Disk (HDSD)</li>\n<li>C# specification suite</li>\n<li>Psychoacoustic metrics for ITT equipment</li>\n<li>Architecture for a distributed real-time access system</li>\n<li>Scalable Sparse Spatial Sound System (S5)</li>\n<li>NFC-SEC test methods</li>\n<li>Data migration method for BD recordable and BD rewritable disks</li>\n<li>cryptography Standard</li>\n<li>Dart programming language</li>\n<li>The JSON data interchange syntax</li>\n<li>...</li>\n</ul>\nDie ECMA arbeitet eng mit anderen Standardisierungsorganisationen wie der ISO (International Organization for Standardization) zusammen, um sicherzustellen, dass ihre Standards international anerkannt sind."},{"type":"subheader","crDate":1715168634392,"chDate":1715168665850,"text":"Technical Comitee (TC)"},{"type":"paragraph","crDate":1715169603723,"chDate":1715170119044,"text":"Die Arbeit an den Standards ist in technische Komitees aufgeteilt. Jedes technische Kommitee kümmert sich um ein Thema. \nIn den technischen Komitees werden Vorschläge zu den Standards gemacht und diskutiert. Nach dem Durchlauf einer Besprechungsphase fließt der Vorschlag dann in den Standard ein."},{"type":"subheader","crDate":1715170123276,"chDate":1715170248773,"text":"ECMA Script"},{"type":"paragraph","crDate":1715170251116,"chDate":1715170992121,"text":"Im Technical Comitee 39 (<i>TC39</i>) wird die Zukunft von Javascript festgelegt.\nDieser ECMA-Script genannte Standard ist der theoretische Unterbau für Javascript.\nJedes Jahr im Juni wird eine neue Version des Standards veröffentlicht und die Browserhersteller geben sich die größte Mühe, diese Standards in die Browser zu integrieren. Das bedeutet unter anderem, dass nicht alle in ECMAScript beschriebenen Techniken auch in allen Browsern funktionieren. Manchmal dauert es eine Weile, bis ein Standard umgesetzt wurde.\nJede:r JS-Entwickler:in kann sich mit eigenen Vorschlägen an der Weiterentwicklung von Javascript beteiligen und im TC39 (<a href=\"https://github.com/tc39/ecma262\">Link</a>) Vorschläge machen. Diese müssen natürlich schon ausgearbeitet sein und funktionieren. "},{"type":"links","crDate":1715170373520,"chDate":1715170373520,"links":[{"title":"ECMAScript® 2025","url":"https://tc39.es/ecma262/"},{"title":"Vorschlag-Prozess ","url":"https://tc39.es/process-document/"}]}]}