{"content":[{"type":"paragraph","crDate":1759238377046,"chDate":1770813411393,"text":"Webentwicklung ist ein ständiges Abwägen zwischen Fragen der Einfachheit, SEO, Ladegeschwindigkeit, Modularität und Dutzenden weiteren Dingen.\nAuf diese Wünsche gibt es verschiedene Antworten: SSG (Static Site Generation), SSR (Server Side Rendering), CSR (Client Side Rendering) sind nur die wichtigsten.\nNextJS bietet ein System, das halbautomatisch die verschiedenen Techniken miteinander kombiniert:\n<ul>\n<li>Wann immer möglich (und das ist meistens) wird SSG verwendet.</li>\n<li>Dynamische Daten werden per SSR eingebunden.</li>\n<li>Interaktive Elemente (Buttons, Inputs, etc) werden auf dem Cient gerendert.</li>\n</ul>\nUm das zu erreichen, ist nextJS erstmal ein System, das einen mit der Komplexität zu erschlagen scheint. \nAber wenn man sich anfangs nur um die Punkte kümmert, die für die eigenen Wünsche relevant sind, bekommt man schon bald erste Ergebnisse."},{"type":"subheader","crDate":1759239826301,"chDate":1759239843195,"text":"Installation"},{"type":"paragraph","crDate":1759239845678,"chDate":1759239977932,"text":"Zur Installation von nextJS kann mit <i>npx</i> das Script <i>create-next-app</i> aufgerufen werden.\nDas Script ruft einen Wizard auf, der die wichtigsten Fragen stellt, um Informationen über das Projekt zu sammeln."},{"type":"terminal","crDate":1759240161662,"chDate":1770812974080,"text":"npx create-next-app myapp\n\n√ Would you like to use TypeScript? ... No / Yes\n√ Which linter would you like to use? » None\n√ Would you like to use Tailwind CSS? ... No / Yes\n√ Would you like your code inside a `src/` directory? ... No / Yes\n√ Would you like to use App Router? (recommended) ... No / Yes\n√ Would you like to use Turbopack? (recommended) ... No / Yes\n√ Would you like to customize the import alias (`@/*` by default)? ... No / Yes"},{"type":"subheader","crDate":1759323229560,"chDate":1759323234353,"text":"Skripte"},{"type":"paragraph","crDate":1759241789242,"chDate":1770805011755,"text":"Standardmäßig werden drei Scripte eingebunden:\n<ul><li><b>npm run dev: </b>Startet den Entwicklungsserver mit <i>Hot Reload</i>.</li>\n<li><b>npm run build</b>: Erzeugt die optimierte Version zur Veröffentlichung.</li>\n<li><b>npm run start: </b>Startet den Produktionsserver, falls <i>npm run build</i> bereits ausgeführt wurde.</li></ul>"},{"type":"subheader","crDate":1759323449793,"chDate":1759323455605,"text":"layout.js"},{"type":"paragraph","crDate":1759323458402,"chDate":1770818085754,"text":"Die Datei /app/layout.js ist eine zentrale Komponente in Next.js-Anwendungen, die das Root Layout für die gesamte Anwendung definiert. Sie befindet sich im <i>`app</i>`-Verzeichnis und stellt die grundlegende HTML-Struktur für alle Seiten bereit.\nDas Layout definiert das grundlegende HTML-Gerüst, das alle Seiten der Anwendung umschließt. Jede Unterseite wird innerhalb dieses Layouts gerendert.\nSie ist der einzige Ort in Next.js, wo &lt;html> und &lt;body>-Tags definiert werden können\nSie stellen die grundlegende DOM-Struktur für die gesamte Anwendung bereit\n \n<b>Globale Ressourcen</b>\nCSS-Imports: Globale Stylesheets werden hier eingebunden und gelten für die gesamte Anwendung\nFont-Konfiguration: Definition und Konfiguration von Schriftarten (z.B. Google Fonts)\nCSS-Variablen: Bereitstellung von CSS-Custom-Properties für konsistente Gestaltung\n \n<b>Metadata-Verwaltung</b>\nExport von Standard-Metadaten für SEO-Optimierung:\n- Seitentitel: `title\n- Seitenbeschreibung: description\n- Weitere Meta-Tags nach Bedarf\n \n<b>Children-Prop</b>\nDer children-Parameter fungiert als Platzhalter für den Inhalt aller Unterseiten und ermöglicht die dynamische Einbettung von Seiteninhalten.\n \n<b>Performance-Optimierungen</b>\nEinmalige Ladung: Das Layout wird nur beim ersten Aufruf geladen\nPersistenz: Bleibt beim Navigieren zwischen Seiten bestehen\n \n<b>Anwendungsbeispiele</b>\n- Gemeinsame UI-Elemente (Header, Footer, Navigation)\n- Konsistente Gestaltung über alle Seiten hinweg\n- Globale Zustandsverwaltung\n- Authentifizierungs-Wrapper\n \n<b>Best Practices</b>\nMinimaler Inhalt: Nur grundlegende, seitenübergreifende Elemente einbinden\nPerformance: Schwere Operationen vermeiden, da das Layout bei jeder Navigation aktiv bleibt\nAccessibility: Semantische HTML-Struktur und entsprechende Attribute verwenden\nSEO: Relevante Metadata für Suchmaschinenoptimierung definieren"}]}