{"content":[{"type":"paragraph","crDate":1759238377046,"chDate":1759241987349,"text":"Next.js ist ein leistungsstarkes Framework, das auf React aufbaut und hilft, professionelle, performante und skalierbare Webanwendungen zu entwickeln – sowohl im Frontend als auch im Backend.\nEs bietet zusätzliche Features, die über das reine React hinausgehen.\nWichtige Eigenschaften von Next.js:\n<ul><li><b>Server-Side Rendering (SSR): </b>Next.js kann Seiten auf dem Server rendern, bevor sie an den Browser gesendet werden. Das verbessert die Ladezeiten und die Suchmaschinenoptimierung (SEO).</li>\n<li><b>Static Site Generation (SSG): </b>Seiten können auch schon beim Build statisch generiert werden, was besonders für schnelle und sichere Webseiten sorgt.</li>\n<li><b>Full-Stack-Fähigkeiten: </b>Next.js ist nicht nur für das Frontend gedacht, sondern unterstützt auch serverseitige Logik, APIs und Datenbankanbindungen.</li>\n<li><b>Empfohlenes Toolchain: </b>Die offizielle React-Dokumentation empfiehlt Next.js als Toolchain, wenn du eine vollständige Webanwendung mit React bauen möchtest.</li></ul>\n\n."},{"type":"subheader","crDate":1759241991369,"chDate":1759241997072,"text":"Typische Einsatzgebiete"},{"type":"paragraph","crDate":1759241966860,"chDate":1759242659362,"text":"Next.js wird meist eingesetzt für:\n<ul><li>SEO-optimierte Webseiten: z.B. Unternehmensseiten, Blogs, News-Portale.</li>\n<li>E-Commerce-Plattformen: Schnelle Ladezeiten und gute SEO sind hier besonders wichtig.</li>\n<li>Dashboards und Webanwendungen: Dank SSR und SSG können auch komplexe Anwendungen performant umgesetzt werden</li>\n<li>Große, skalierbare Projekte: Viele bekannte Marken wie Nike oder TikTok setzen auf Next.js.</li>"},{"type":"subheader","crDate":1759239826301,"chDate":1759239843195,"text":"Installation"},{"type":"paragraph","crDate":1759239845678,"chDate":1759239977932,"text":"Zur Installation von nextJS kann mit <i>npx</i> das Script <i>create-next-app</i> aufgerufen werden.\nDas Script ruft einen Wizard auf, der die wichtigsten Fragen stellt, um Informationen über das Projekt zu sammeln."},{"type":"terminal","crDate":1759240161662,"chDate":1759240164151,"text":"√ Would you like to use TypeScript? ... No / Yes\n√ Which linter would you like to use? » None\n√ Would you like to use Tailwind CSS? ... No / Yes\n√ Would you like your code inside a `src/` directory? ... No / Yes\n√ Would you like to use App Router? (recommended) ... No / Yes\n√ Would you like to use Turbopack? (recommended) ... No / Yes\n√ Would you like to customize the import alias (`@/*` by default)? ... No / Yes"},{"type":"subheader","crDate":1759323229560,"chDate":1759323234353,"text":"Skripte"},{"type":"paragraph","crDate":1759241789242,"chDate":1759323253198,"text":"Standardmäßig werden drei Scripte eingebunden:\n<ul><li><b>npm run dev: </b>Startet den Entwicklungsserver mit <i>Hot Reload</i>.</li>\n<li><b>npm run build: Erzeugt die optimierte Version zur Veröffentlichung.</b></li>\n<li><b>npm run start: </b>Startet den Produktionsserver, falls <i>npm run build</i> bereits ausgeführt wurde.</li></ul>"},{"type":"subheader","crDate":1759323449793,"chDate":1759323455605,"text":"layout.js"},{"type":"paragraph","crDate":1759323458402,"chDate":1759325891573,"text":"Die layout-Datei ist eine zentrale Komponente in Next.js-Anwendungen, die das Root Layout für die gesamte Anwendung definiert. Sie befindet sich im <i>`app</i>`-Verzeichnis und stellt die grundlegende HTML-Struktur für alle Seiten bereit.\nDas Layout definiert das grundlegende HTML-Gerüst, das alle Seiten der Anwendung umschließt. Jede Unterseite wird innerhalb dieses Layouts gerendert.\nSie ist der einzige Ort in Next.js, wo <html> und <body>-Tags definiert werden können\nSie stellen die grundlegende DOM-Struktur für die gesamte Anwendung bereit\n<b>Globale Ressourcen</b>\nCSS-Imports: Globale Stylesheets werden hier eingebunden und gelten für die gesamte Anwendung\nFont-Konfiguration: Definition und Konfiguration von Schriftarten (z.B. Google Fonts)\nCSS-Variablen: Bereitstellung von CSS-Custom-Properties für konsistente Gestaltung\n<b>Metadata-Verwaltung</b>\nExport von Standard-Metadaten für SEO-Optimierung:\n- Seitentitel () `title`\n- Seitenbeschreibung () `description`\n- Weitere Meta-Tags nach Bedarf\n<b>Children-Prop</b>\nDer children-Parameter fungiert als Platzhalter für den Inhalt aller Unterseiten und ermöglicht die dynamische Einbettung von Seiteninhalten.\n<b>Performance-Optimierungen</b>\nEinmalige Ladung: Das Layout wird nur beim ersten Aufruf geladen\nPersistenz: Bleibt beim Navigieren zwischen Seiten bestehen\nKeine Neuladung: Seitenwechsel führen nicht zu einem kompletten Neuladen des Layouts\n<b>Anwendungsbeispiele</b>\n- Gemeinsame UI-Elemente (Header, Footer, Navigation)\n- Konsistente Gestaltung über alle Seiten hinweg\n- Globale Zustandsverwaltung\n- Authentifizierungs-Wrapper\n<b>Best Practices</b>\nMinimaler Inhalt: Nur grundlegende, seitenübergreifende Elemente einbinden\nPerformance: Schwere Operationen vermeiden, da das Layout bei jeder Navigation aktiv bleibt\nAccessibility: Semantische HTML-Struktur und entsprechende Attribute verwenden\nSEO: Relevante Metadata für Suchmaschinenoptimierung definieren"}]}