{"content":[{"type":"paragraph","crDate":1684928463267,"chDate":1684928464159,"text":"Es gibt eine ganze Reihe von Editoren für Web-Code (HTML, CSS, Javascript, anderes).\nNicht alle sind gleich gut geeignet, um Webseiten und Apps zu erstellen. Hier soll eine kleine Übersicht helfen.\nEin Sonderfall ist der Visual Studio Code (kurz: VSCode), weil dieser Editor im Unterricht, zu dem diese Dokumentation gehört, als Standard-Editor verwendet wird. Für VSCode ist daher eine eigene Seite reserviert."},{"type":"subheader","crDate":1684929920981,"chDate":1684929927298,"text":"Brackets"},{"type":"paragraph","crDate":1684929974206,"chDate":1684930373517,"text":"Brackets ist ein beliebter Editor, der ein schnelles und flüssiges Arbeiten ermöglicht. \nDer Vergleich zu VSCode liegt nahe, da Brackets ebenfalls auf Webtechnologien basiert, ähnlich aufgebaut ist und auch quelloffen ist."},{"type":"links","crDate":1684929948308,"chDate":1684929948308,"links":[{"title":"Offizielle Webseite","url":"https://brackets.io/"}]},{"type":"subheader","crDate":1684931568786,"chDate":1684931572905,"text":"PHP Storm"},{"type":"paragraph","crDate":1684931589713,"chDate":1684931781242,"text":"PHP Storm ist die vermutlich leistungsstärkste Software zum Entwickeln von Webprojekten. Der Name legtnahe, dass es sich um einen Editor speziell für PHP handelt. Das ist heute nicht mehr wahr und der Name ist nur historisch zu sehen.\nPHP Storm bietet alles, was VSCode ausmacht, nur besser. Und mehr.\nAllerdings ist PHP Storm kostenpflichtig und kostet pro Anwender 149 - 249€ / Jahr. "},{"type":"links","crDate":1684931576458,"chDate":1684931576458,"links":[{"title":"Offizielle Webseite","url":"https://www.jetbrains.com/phpstorm"}]},{"type":"subheader","crDate":1684931865180,"chDate":1684931868805,"text":"Atom"},{"type":"paragraph","crDate":1684931885235,"chDate":1684931974012,"text":"Atom ist bekannt für seine Flexibilitt und nennt sich selbst \"The hackable text editor\".\nLeider hat Github, die Entwickler hinter dem Tool, kürzlich angekündigt, die Entwicklung für Atom einzustellen."},{"type":"links","crDate":1684931870764,"chDate":1684931870764,"links":[{"title":"Offizielle Webseite","url":"https://github.com/atom/atom"}]},{"type":"subheader","crDate":1684929912574,"chDate":1684929918503,"text":"Notepad++"},{"type":"paragraph","crDate":1684930653736,"chDate":1684930858647,"text":"Notepad++ ist vor allem dann hilfreich, wenn nur \"mal schnell\" etwas ausprobiert werden soll. \nAußerdem ist es in der Lage, in sehr großen Dateien zügig zu arbeiten.\nFür die Organisation und Entwicklung aufwendigerer Projekte dagegen ist Notepad++ weniger geeignet."},{"type":"links","crDate":1684930880398,"chDate":1684930880398,"links":[{"title":"Offizielle Webseite","url":"https://notepad-plus-plus.org/downloads/"}]}]}