{"content":[{"type":"paragraph","crDate":1692796907648,"chDate":1692798636571,"text":"HTTP-Anfragen und -Antworten können verschiedene Headers übertragen, worüber dei Übertragung gesteuert oder Daten übertragen werden können.\nDie gängigsten Headers sind:\n<b>Accept</b>\nDieser Header gibt an, welche Medientypen der Client akzeptieren möchte.\n<b>Accept-Charset</b>\nDieser Header gibt an, welche Zeichensätze der Client akzeptieren möchte.\n<b>Accept-Encoding</b>\nDieser Header gibt an, welche Komprimierungsalgorithmen der Client akzeptieren möchte.\n<b>Accept-Language</b>\nDieser Header gibt an, welche Sprachen der Client akzeptieren möchte.\n<b>Authorization</b>\nDieser Header enthält die Autorisierungsinformationen für den Zugriff auf eine Ressource.\n<b>Connection</b>\nDieser Header gibt an, wie die Verbindung zwischen dem Client und dem Server verwaltet werden soll.\n<b>Content-Length</b>\nDieser Header gibt die Länge des Körpers der Anfrage an.\n<b>Content-Type</b>\nDieser Header gibt den Medientyp des Körpers der Anfrage an.\n<b>Cookie</b>\nDieser Header enthält Cookies, die vom Server an den Client gesendet werden.\n<b>Date</b>\nDieser Header gibt das Datum und die Uhrzeit der Anfrage an.\n<b>Expect</b>\nDieser Header gibt an, welche Erwartungen der Client an die Antwort hat.\n<b>Host</b>\nDieser Header gibt den Hostnamen des Servers an, mit dem der Client kommuniziert.\n<b>If-Match</b>\nDieser Header gibt an, dass die Antwort nur zurückgegeben werden soll, wenn der Wert der ETag mit dem Wert des If-Match-Headers übereinstimmt.\n<b>If-Modified-Since</b>\nDieser Header gibt an, dass die Antwort nur zurückgegeben werden soll, wenn die Ressource seit dem angegebenen Datum geändert wurde.\n<b>If-None-Match</b>\nDieser Header gibt an, dass die Antwort nur zurückgegeben werden soll, wenn der Wert der ETag nicht mit dem Wert des If-None-Match-Headers übereinstimmt.\n<b>If-Range</b>\nDieser Header gibt an, dass die Antwort nur zurückgegeben werden soll, wenn der Wert des ETag mit dem Wert des If-Range-Headers übereinstimmt, und gibt den Bereich der Ressource an, der zurückgegeben werden soll.\n<b>If-Unmodified-Since</b>\nDieser Header gibt an, dass die Antwort nur zurückgegeben werden soll, wenn die Ressource seit dem angegebenen Datum nicht geändert wurde.\n<b>Last-Modified</b>\nDieser Header gibt das Datum und die Uhrzeit an, an dem die Ressource zuletzt geändert wurde.\n<b>Location</b>\nDieser Header gibt die URL einer neuen Ressource an.\n<b>Pragma</b>\nDieser Header enthält Anweisungen für den Cache-Manager.\n<b>Proxy-Authorization</b>\nDieser Header enthält die Autorisierungsinformationen für den Zugriff auf eine Ressource über einen Proxy-Server.\n<b>Range</b>\nDieser Header gibt den Bereich der Ressource an, der zurückgegeben werden soll.\n<b>Referer</b>\nDieser Header gibt die URL der Seite an, von der die Anfrage stammt.\n<b>Retry-After</b>\nDieser Header gibt an, wie lange der Client warten soll, bevor er die Anfrage erneut versucht.\n<b>Server</b>\nDieser Header gibt den Namen des Servers an, der die Antwort zurückgibt.\n<b>Transfer-Encoding</b>\nDieser Header gibt den Komprimierungsalgorithmus an, der für die Antwort verwendet wird.\n<b>Upgrade</b>\nDieser Header gibt an, dass der Client eine neuere Version des Protokolls verwenden möchte.\n<b>User-Agent</b>\nDieser Header gibt den Namen des Clients an, der die Anfrage stellt."}]}