{"content":[{"type":"paragraph","crDate":1691675699255,"chDate":1691675799231,"text":"Eine gute Liste aller relevanten Events ist schwer zu finden. Daher will ich versuchen, hier eine solche Liste zusammenzustellen."},{"type":"subheader","crDate":1691675806616,"chDate":1692191319393,"text":"Maus-Events"},{"type":"paragraph","crDate":1692191325867,"chDate":1692191364030,"text":"Events, die durch Aktionen der Maus auf einem DOM-Element ausgelöst werden können."},{"type":"paragraph","crDate":1691675841341,"chDate":1692191239653,"text":"<b>click</b>\nReagiert darauf, dass mit der Maus ein Element <i>angeklickt</i> wird\n<b>mousedown</b>\nReagiert darauf, dass die Maustaste <i>gedrückt</i> wird, während sich der Cursor auf einem Element befindet.\n<b>mouseup</b>\nReagiert darauf, dass die Maustaste <i>losgelassen</i> wird, während sich der Cursor auf einem Element befindet.\n<b>mouseover</b>\nReagiert darauf, dass die Maus <i>auf ein Element rollt</i>. Auch Kind-Elemente reagieren.\n<b>mouseenter</b>\nReagiert darauf, dass die Maus <i>auf ein Element rollt</i>. Kind-Elemente reagieren nicht.\n<b>mouseout</b>\nReagiert darauf, dass die Maus <i>ein Element verlässt</i>. Auch Kind-Elemente reagieren.\n<b>mouseleave</b>\nReagiert darauf, dass die Maus <i>ein Element verlässt</i>. Kind-Elemente reagieren nicht.\n<b>mousemove</b>\nReagiert darauf, dass sich die Maus auf einem <i>bewegt</i>."},{"type":"subheader","crDate":1691675817966,"chDate":1691676076643,"text":"Eingabeevents"},{"type":"paragraph","crDate":1692191369413,"chDate":1692191448599,"text":"Events, die durch Eingaben in Formularelemente gemacht werden können. Die \"Formularelemente\" müssen dabei nicht in einem Formular geschachtelt sein. Bei den meisten dieser Events andelt es sich um Tastatur-Events."},{"type":"paragraph","crDate":1691675894088,"chDate":1692191268212,"text":"<b>input</b>\nReagiert auf jeden Tastenanschlag\n<b>keydown</b>\nReagiert darauf, dass eine Taste <i>gedrückt</i> wird. Wird gefeuert, bevor die Änderung im Eingabefeld vorgenommen wurde.\n<b>keyup</b>\nReagiert darauf, dass eine Taste <i>losgelassen</i> wird. \n<b>keypress</b>\nWie keydown, aber reagiert nicht auf Steuertasten.\n<b>change</b>\nReagiert darauf, dass sich etwas am Inhalt <i>geändert</i> hat und das Element den <i>Fokus verliert</i> bzw die <i>Enter</i>-Taste gedrückt wird.\n<b>focus</b>\nReagiert darauf, dass das Element den Fokus erhält.\n<b>blur</b>\nReagiert darauf, dass das Element den Fokus verliert.\n<b>submit</b>\nReagiert darauf, dass ein Formular <i>abgesendet</i> wurde."},{"type":"subheader","crDate":1691675945662,"chDate":1692191470294,"text":"Andere Events"},{"type":"paragraph","crDate":1692191474270,"chDate":1692191484925,"text":"Events, die oben nicht hinein passten."},{"type":"paragraph","crDate":1691675956173,"chDate":1705071784760,"text":"<b>scroll</b>\nKann auf das Window oder ein DOM-Element angewendet werden und reagiert auf das Scrolling\n<b>load</b>\nKann auf das window oder ein DOM-Element angewendet werden. Reagiert darauf, dass die Medien-Datei(en) geladen wurde.\n<b>DOMContentLoaded</b>\nWird auf das Document angewendet. Reagiert auf den Abschluss des Ladens der Dokumentenstruktur des DOM.\n<b>resize</b>\nWird auf das Window angewendet. Reagiert auf eine Änderung der Größe des Viewport.\n<b>error</b>\nWird auf DOM-Elemente angewendet. Reagiert darauf, dass die Mediendatei nicht geladen werden konnten.\n<b>transitionended</b>\nReagiert darauf, dass eine CSS-Transition beendet ist."}]}