{"content":[{"type":"paragraph","crDate":1693305897255,"chDate":1693313716442,"text":"Der pragmatischste Weg, React zu installieren ist ein dafür entwickeltes Modul. \nDerer gibt es jedoch recht viele, daher soll hier eine Übersicht über die wichtigsten Frameworks helfen.\nEgal, welche der Lösungen unten verwendet wird, am Ende steht eine einfache React-App."},{"type":"subheader","crDate":1693311507991,"chDate":1693311514287,"text":"create-react-app"},{"type":"paragraph","crDate":1693311515798,"chDate":1693311850430,"text":"Ein Befehlszeilenwerkzeug, mit dem Entwickler schnell und einfach ein neues React-Projekt einrichten können. Es ist ein offizielles Werkzeug von Facebook, dem Unternehmen hinter React, und bietet eine standardisierte und optimierte Konfiguration für die Entwicklung von React-Anwendungen.\nMit Create React App können Entwickler ohne großen Aufwand ein React-Projekt starten, ohne sich um die Einrichtung von Build-Tools oder Konfigurationsdateien kümmern zu müssen. Es erstellt automatisch eine vorkonfigurierte Projektstruktur und stellt ein Entwicklungsserver bereit, der Live-Reload und Fehlermeldungen unterstützt.\nLeider wird create-react-app seit 2023 nicht mehr weiterentwickelt.\nAufgrund der relativen Einfachheit einer mit diesem Tool erzeugten App ist create-react-app insbesondere für Anfänger:innen bis auf weiteres immer noch die beste Wahl."},{"type":"terminal","crDate":1693311632502,"chDate":1693311890270,"text":"npm i create-react-app\nnpx create-react-app myapp\ncd myapp\nnpm run start"},{"type":"subheader","crDate":1693311284335,"chDate":1693311289095,"text":"NextJS"},{"type":"paragraph","crDate":1693311291166,"chDate":1693313491202,"text":"Ein Framework, das auf React basiert und die Entwicklung von serverseitig gerenderten Webanwendungen erleichtert. Es bietet eine einfache und effektive Möglichkeit, React-Komponenten für das Server-Side Rendering (SSR) zu verwenden.\nDas Framework wurde von Vercel entwickelt und ist bekannt für seine Leistung, Flexibilität und Benutzerfreundlichkeit. Next.js ermöglicht es Entwicklern, Webanwendungen zu erstellen, die sowohl serverseitig als auch clientseitig gerendert werden können. Dies bedeutet, dass die Inhalte sowohl auf dem Server als auch im Browser gerendert werden können, was zu einer besseren Leistung, SEO und Benutzererfahrung führt.\nNext.js bietet eine Vielzahl von Funktionen, darunter Routen- und Dateibasiertes Routing, automatisches Code-Splitting, Hot-Reload und eine integrierte API-Routing-Lösung. Es unterstützt auch eine Vielzahl von Datenquellen und Datenabfragemethoden, einschließlich GraphQL und REST."},{"type":"terminal","crDate":1693311410158,"chDate":1693311434796,"text":"npx create-next-app myapp\ncd myapp\nnpm run dev"},{"type":"links","crDate":1693308501566,"chDate":1693308501566,"links":[{"title":"nextJS","url":"https://nextjs.org"}]},{"type":"subheader","crDate":1693311330835,"chDate":1693311335162,"text":"Gatsby"},{"type":"paragraph","crDate":1693311351546,"chDate":1693311353019,"text":"Ein JavaScript-Framework zur Entwicklung von Webanwendungen und statischen Websites. Es basiert auf React und verwendet GraphQL für Datenabfragen. Gatsby ermöglicht es Entwicklern, schnell und effizient leistungsstarke Websites zu erstellen, die auf modernen Webtechnologien wie Server-Side Rendering (SSR) und Static Site Generation (SSG) basieren.\nDas Besondere an Gatsby ist, dass es statische HTML-Seiten generiert, die dann bei Bedarf dynamisch geladen und aktualisiert werden können. Dadurch können Websites mit Gatsby sehr schnell reagieren und eine bessere Benutzererfahrung bieten.\nGatsby bietet eine Vielzahl von Funktionen und Plugins, die Entwicklern helfen, ihre Websites zu optimieren und zu erweitern. Es unterstützt auch eine breite Palette von Datenquellen, darunter CMS-Systeme, Datenbanken und APIs."},{"type":"terminal","crDate":1693311377792,"chDate":1693311470425,"text":"npx gatsby new myapp\ncd myapp\ngatsby develop"},{"type":"links","crDate":1693311356138,"chDate":1693311356138,"links":[{"title":"Gatsby","url":"https://www.gatsbyjs.com/"}]},{"type":"subheader","crDate":1693312822977,"chDate":1693312986561,"text":"Vite"},{"type":"paragraph","crDate":1693312828754,"chDate":1693312993853,"text":"Vite ist ein Build-Tool und eine Entwicklungsumgebung für moderne Webanwendungen. Es wurde ursprünglich von der Vue.js-Community entwickelt, hat sich jedoch mittlerweile zu einem eigenständigen Tool entwickelt, das auch außerhalb des Vue-Ökosystems verwendet werden kann.\nVite zeichnet sich durch seine Schnelligkeit und Effizienz aus. Es bietet eine schnellere Startzeit und ein schnelles Hot-Module-Replacement, was die Entwicklungszeit verkürzt. Im Vergleich zu herkömmlichen Build-Tools ermöglicht Vite das direkte Ausführen von JavaScript-Modulen im Browser, anstatt sie zuvor zu bündeln. Dies ermöglicht eine schnellere Entwicklungserfahrung, insbesondere bei größeren Projekten.\nVite unterstützt verschiedene Frontend-Frameworks wie Vue.js, React und Preact. Es ermöglicht das Entwickeln von Anwendungen mit modernen JavaScript-Funktionen wie ES Modules, TypeScript, CSS-in-JS und mehr. Darüber hinaus bietet Vite eine integrierte Entwicklungsserver, der Live-Reload, Hot-Module-Replacement und eine optimierte Build-Phase für die Produktion bereitstellt."},{"type":"terminal","crDate":1693313209114,"chDate":1693313296984,"text":"npm init vite@latest myapp\n// Einige Fragen beantworten, u.a. Auswahl von React als FE\ncd myapp\nnpm install\nnpm run dev\n"},{"type":"links","crDate":1693313522528,"chDate":1693313522528,"links":[{"title":"Vite","url":"https://vitejs.dev/"}]}]}