{"content":[{"type":"paragraph","crDate":1755252529143,"chDate":1757923552408,"text":"<i>Vite</i> (frz. für \"schnell\", ausgesprochen \"Wiet\") ist ein modernes Build-Tool und Entwicklungsserver für JavaScript-Projekte. Es ist darauf ausgelegt, schnelle Entwicklungszeiten und eine effiziente Bündelung von Code zu ermöglichen. Vite nutzt native ES-Module, um die Entwicklungszeit zu verkürzen, da es nicht den gesamten Bundle nach jeder Änderung neu erstellt.\nIm Zusammenhang mit React funktioniert Vite als <i>Build-Tool</i>, das denn Code bündelt und transpiliert, sodass der Browser ihn verstehen kann. Es bietet auch Skripte für das Ausführen eines Entwicklungsservers und das Hinzufügen von Testskripten, was viele lästige Aufgaben automatisiert.\nVite ist besonders schnell und leichtgewichtig, was die Einrichtung neuer Projekte beschleunigt.\nEs ist eine gute Alternative zu Create React App, da es eine schnellere Entwicklung ermöglicht und weniger Ressourcen verbraucht."},{"type":"paragraph","crDate":1755252655854,"chDate":1757923470224,"text":"Eine Besonderheit ist, dass Vite sehr frei ist, mit welcher Technik es arbeitet.\nTatsächlich ist es ursprünglich für Vue entwickelt worden, mach aber auch für React eine gute Figur.\nEs kann ganz ohne Framework arbeiten, oder eines von vielen auswählen: <i>Vue</i>, <i>React</i>, <i>Preact</i>, <i>Lit</i>, <i>Svelte</i>, <i>Solid</i>, <i>Qwik</i>, <i>Angular</i>, <i>Marko</i>, Others"},{"type":"subheader","crDate":1755253297695,"chDate":1755253304133,"text":"Installation"},{"type":"terminal","crDate":1755253308060,"chDate":1755253684558,"text":"npm create vite@latest yourappname"},{"type":"paragraph","crDate":1755253686950,"chDate":1755253717474,"text":"Dadurch wird ein Wizard gestartet, der einige Einstellungen ermöglicht."},{"type":"terminal","crDate":1755253731381,"chDate":1755253778130,"text":"*  Select a framework:\n|    Vanilla\n|    Vue\n|  > React\n|    Preact\n|    Lit\n|    Svelte\n|    Solid\n|    Qwik\n|    Angular\n|    Marko\n|    Others"},{"type":"terminal","crDate":1755253745302,"chDate":1755253773012,"text":"*  Select a variant:\n|    TypeScript\n|    TypeScript + SWC\n|  > JavaScript\n|    JavaScript + SWC\n|    React Router v7 ↗\n|    TanStack Router ↗\n|    RedwoodSDK ↗\n|    RSC ↗"},{"type":"paragraph","crDate":1755253811914,"chDate":1755254204198,"text":"Nach Beantwortung wird die grundlegende Dateistruktur angelegt. \nWas noch fehlt sind die notwendigen Module, die in einem eigenen Schritt installiert werden."},{"type":"terminal","crDate":1755254209698,"chDate":1755254229031,"text":"cd yourapp\nnpm install"},{"type":"paragraph","crDate":1755256430329,"chDate":1755256543102,"text":"Wenn dann alle Module installiert sind, kann der Entwicklungsserver gestartet werden."},{"type":"terminal","crDate":1755256545926,"chDate":1755256567175,"text":"npm run dev"}]}