{"content":[{"type":"paragraph","crDate":1713778051076,"chDate":1713778079906,"text":"Der Begriff Routing beschreibt die <i>Navigation</i> auf einer Single Page Applcation.\nDie gesamte Navigation findet im Browser statt. Elemente werden ein- und ausgeblendet, anstatt neu vom Server geladen zu werden.\nDas macht die Reaktionszeit einer Webseite schneller und verbessert das Nutzererlebnis erheblich.\nAllerdings geht es nicht mur um das Anzeigen von Inhalten, das Routing legt auch die Adresse in die Browserhistory und erlaubt es, einzelne Seiten über die URL (per Link oder Bookmark) aufzurufen."},{"type":"paragraph","crDate":1713778500361,"chDate":1713779620870,"text":"Vue-CLI bietet bereits ein integriertes Routing. Der beste Weg ist, es bei der Auswahl von von vornherein in ein Projekt zu integrieren.\nWährend des Anlegens eines Projektes kann das Routing aktiviert werden."},{"type":"image","crDate":1713779502834,"chDate":1713779502834,"filename":"7653427c91123c9773ab4ef01.PNG","subtext":""},{"type":"paragraph","crDate":1713780044930,"chDate":1713780194749,"text":"Die Hauptdatei bekommt das Routing als Modul eingebunden. Hierum müssen wir uns nicht kümmern."},{"type":"code","crDate":1713780028638,"chDate":1713780058180,"text":"import { createApp } from 'vue'\nimport App from './App.vue'\nimport router from './router'\n\ncreateApp(App).use(router).mount('#app')"},{"type":"paragraph","crDate":1713780268046,"chDate":1713782190490,"text":"In einem Unterordner <i>router</i> wird eine <i>index.js</I> angelegt.\nDiese stellt die Routen in Form von Objekten bereit, die als Menü angezeigt werden sollen. Jedes Objekt hat zwei Pflicht-Attribute:\n<ul>\n<li><b>path</b> enthält den virtuellen Pfad, der in der Adressleiste und in der History auftaucht.</li>\n<li><b>component</b> enthält den Namen der Komponente, die auf der Webseite angezeigt werden soll.\nDiese Komponente kann per <i>lazy-loading</i> eingebunden werden, was bedeutet, dass sie erst bei Klick auf den Link geladen wird.</li>\n</ul>"},{"type":"code","crDate":1713782216131,"chDate":1713786670919,"text":"import { createRouter, createWebHistory } from 'vue-router'\nimport HomeView from '../views/HomeView.vue'\n\nconst routes = [{\n path: '/',\n component: HomeView\n}, {\n path: '/about',\n // \"lazy loading\"\n component: () => import('../views/AboutView.vue')\n}]\n\nconst router = createRouter({\n history: createWebHistory(process.env.BASE_URL),\n routes\n})\n\nexport default router\n"},{"type":"paragraph","crDate":1713782513979,"chDate":1713786014097,"text":"Als letzter Schritt muss noch das Menü und der Anzeigebereich eingebaut werden.\nDazu werden im Haupt-Vue <i>router-link</i>-Tags eingebunden. Diese Tags erhalten das <i>to</i>-Attribut, das mit dem gewünschten <i>path</i>-Attribut aus dem Router übereinstimmen muss. \nDas <i>router-view</i>-Tag schließlich bestimmt, an welcher Stelle die Inhalte aus den Komponenten gerendert werden.\nDie zu rendernden Komponenten übrigens brauchen hier nicht importiert zu werden."},{"type":"code","crDate":1713786018097,"chDate":1713786484769,"text":"&lt;template>\n &lt;nav>\n  &lt;router-link to=\"/\">Home&lt;/router-link> |\n  &lt;router-link to=\"/about\">About&lt;/router-link>\n &lt;/nav>\n &lt;router-view />\n&lt;/template>"}]}