{"content":[{"type":"paragraph","crDate":1695814600259,"chDate":1695815479452,"text":"Um zu steuern, wie neue Formen und Bilder mit vorhandenem Inhalt kombiniert werden, kann der blendmode mit dem Attribut <i>globalCompositeOperation</i> eingestellt werden. Dieses Attribut versteht die folgenden Einstellungen:\n<ul>\n<li><b>source-over</b>\nStandardwert. Die neuen Elemente werden über dem bisherigen Inhalt gelegt.\n</li><li><b>destination-over</b>\nDie neuen Elemente werden unter dem bisherigen Inhalt gelegt.\n</li><li><b>source-in</b>\nDie neuen Elemente werden nur dort gezeichnet, wo sie den bisherigen Inhalt überlappen.\n</li><li><b>destination-in</b>\nDie neuen Elemente werden nur dort gezeichnet, wo sie nicht den bisherigen Inhalt überlappen.\n</li><li><b>source-out</b>\nDie neuen Elemente werden nur dort nicht gezeichnet, wo sie den bisherigen Inhalt überlappen.\n</li><li><b>destination-out</b>\nDie neuen Elemente werden nur dort nicht gezeichnet, wo sie nicht den bisherigen Inhalt überlappen.\n</li><li><b>xor</b>\nDie neuen Elemente werden nur dort gezeichnet, wo sie den bisherigen Inhalt nicht überlappen.\n</li><li><b>multiply</b>\nDie neuen Elemente werden mit dem bisherigen Inhalt vermischt, um einen dunkleren Effekt zu erzielen.\n</li><li><b>screen</b>\nDie neuen Elemente werden mit dem bisherigen Inhalt vermischt, um einen helleren Effekt zu erzielen.\n</li><li><b>overlay</b>\nDie neuen Elemente werden mit dem bisherigen Inhalt vermischt, um einen ausgewogenen Effekt zu erzielen.\n</li><li><b>darken</b>\nDie neuen Elemente werden mit dem bisherigen Inhalt vermischt, um einen dunkleren Effekt zu erzielen, wenn sie dunkler als der bisherige Inhalt sind.\n</li><li><b>lighten</b>\nDie neuen Elemente werden mit dem bisherigen Inhalt vermischt, um einen helleren Effekt zu erzielen, wenn sie heller als der bisherige Inhalt sind\n</li><li><b>color-dodge</b>\nDie neuen Elemente werden mit dem bisherigen Inhalt vermischt, um einen helleren Effekt zu erzielen\n</li><li><b>color-burn</b>\nDie neuen Elemente werden mit dem bisherigen Inhalt vermischt, um einen dunkleren Effekt zu erzielen\n</li><li><b>hard-light</b>\nDie neuen Elemente werden mit dem bisherigen Inhalt vermischt, um einen ausgewogenen Effekt zu erzielen\n</li><li><b>soft-light</b>\nDie neuen Elemente werden mit dem bisherigen Inhalt vermischt, um einen ausgewogenen Effekt zu erzielen\n</li><li><b>difference</b>\nDie neuen Elemente werden mit dem bisherigen Inhalt vermischt, um einen Effekt zu erzielen, bei dem die helleren oder dunkleren Pixel des neuen Elements die Pixel des bisherigen Elements ersetzen.\n</li><li><b>exclusion</b>\nDie neuen Elemente werden mit dem bisherigen Inhalt vermischt, um einen Effekt zu erzielen, bei dem die helleren oder dunkleren Pixel des neuen Elements die Pixel des bisherigen Elements ersetzen</li>\n</ul>"}]}