{"content":[{"type":"paragraph","crDate":1686640207835,"chDate":1686658990248,"text":"Large Language Models (<i>LLM</i>) sind Programme, die darauf ausgelegt sind auf Anfragen in Klartext eine Antwort zu liefern. \nDie Anfrage kann auch die Erstellung von Programmcode sowie die Suche nach Fehlern in verschiedenen Sprachen sein. Da die meisten (wenn nicht alle) KI-Systeme mit Python programmiert sind, ist diese Sprache auch besonders berücksichtigt. Aber auch in Javascript und anderen Sprachen kann eine KI eine große Hilfe sein.\nAktuelle KI-Projekte verstehen noch nicht, was sie da tun, es sind übertrieben leistungsstarke Mustererkennungsprogramme. \nDamit lässt sich schon einiges anfangen und kleine bis mittelgroße Funktionen erstellen. Ein vollständiges Projekt oder mehrere zusammenhängende Funktionen aber setzen ein tieferes Verständnis voraus, das die Maschinen (noch) nicht haben.\nSo ist die KI nichts weiter ein weitere Werkzeug, das die Produktivität erhöht, weil wiederkehrende Tätigkeiten vom Computer erledigt werden können.\nÜbrigens verstehen die meisten LLM auch deutsch."},{"type":"subheader","crDate":1686642085154,"chDate":1686642091458,"text":"ChatGPT"},{"type":"paragraph","crDate":1686642093913,"chDate":1686643074944,"text":"Das wohl bekannteste LLM ist ChatGPT. \nEs ist vor allem bekannt für die Fähigkeit, eine Konversation zu führen. Und ebenso dafür, dass der Wissensstand veraltet ist. Zum Zeitpunkt des Schreibens wusste ChatGPT bspw nicht, dass das JWST bereits sehr erfolgreich operiert. Für unsere Zwecke spielt das keine Rolle, zeigt aber, dass die Antworten dieser Techniken immer mit Vorsicht zu genießen sind.\nChatGPT kann in einer freien Version verwendet werden. Wer mehr will, kann für 20$/Monat eine Bezahlvariante mit schnellerem Zugang und mehr Anfragen kaufen.\nJede Anfrage kreiert einen neuen Code inklusive Erklärung, wie es funktioniert. So lohnt es sind, eine Anfrage mehrfach zu stellen und sich dann das beste herauszupicken.\n"},{"type":"paragraph","crDate":1687260884457,"chDate":1687261408280,"text":"Mit einem Pro-Account (20$ / Monat) lässt sich ChatGPT mit Plugins erweitern. \nBeim Anlegen eines neuen Chats können bis zu drei Plugins in den Chat eingebunden werden, was die Funktionalität deutlich erhöht. \nDazu muss allerdings zunächst in den Einstellungen Plugins aktiviert werden.\nZu den Plugins gehören:\n<ul>\n<li>SEO</li>\n<li>Diagramme</li>\n<li>Kartendarstellung</li>\n<li>Video-Zusammenfassungen für Youtube</li>\n<li>Zusammenfassungen von PDF-Dateien</li>\n<li>Zusammenfassungen von Literatur</li>\n<li>Und vieles mehr ...</li>\n</ul>"},{"type":"links","crDate":1686642116680,"chDate":1686642116680,"links":[{"title":"Offizielle Webseite","url":"https://chat.openai.com/auth/login"}]},{"type":"subheader","crDate":1693482611123,"chDate":1693482614050,"text":"Bard"},{"type":"paragraph","crDate":1693482617417,"chDate":1693482849984,"text":"Google Bard ist das AI-Modell von Google, es basiert auf dem PaLM 2-Modell.\nDer Funktionsumfang ist vergleichbar mit ChatGPT4, es soll allerdings auch in alle Google-Tools (E-Mails, Docs, Presentations, etc.) eingebunden werden.\nZur Nutzung von Bard ist ein Google-Konto erforderlich. \nGoogle hat auch eine Partnerschaft mit Adobe und seinem KI-Modell Firefly eingegangen, um die Bildfähigkeiten von Bard zu verbessern. Dies wurde auf der Google I/O Veranstaltung 2023 angekündigt."},{"type":"links","crDate":1693482856825,"chDate":1693482856825,"links":[{"title":"Bard","url":"https://bard.google.com/"}]},{"type":"subheader","crDate":1686643984086,"chDate":1686643988962,"text":"you.com"},{"type":"paragraph","crDate":1686644001291,"chDate":1693482578508,"text":"You.com ist eine Suchmaschine, die sich seit Ihrer Gründung in 2020 mit dem Thema AI auseinandersetzt.\nDie Anfrage wird standardmäßig als Chat-Anfrage mit ChatGPT 3.5 oder ChatGPT 4 beantwortet. Im Gegensatz zu ChatGPT selbst kombiniert You.com den AI-Chat mit Suchanfragen und kann auch Anfragen zu aktuellen Ereignissen beantworten.\nOptional können auch die üblichen Suchmaschinentools (Text-Suche, Bildsuche, Videosuche, etc) verwendet werden.\nAnfragen liefern deutlich aktuellere Ergebnisse als ChatGPT.\nYou.com ist grundsätzlich kostenlos."},{"type":"links","crDate":1686644990066,"chDate":1686644990066,"links":[{"title":"Offizielle Webseite","url":"https://you.com/"}]},{"type":"subheader","crDate":1686645153494,"chDate":1686645170132,"text":"LLaMa/Alpaca"},{"type":"paragraph","crDate":1686645173755,"chDate":1686651705634,"text":"LLaMa ist ein LLM, das auf dem lokalen Rechner installiert werden kann. \nDadurch ist es etwas besonderes, weil keine Abhängigkeiten zu irgendwelchen Anbietern. Allerdings setzt es etwas Arbeit und Kenntniss voraus."},{"type":"links","crDate":1686645185210,"chDate":1686645185210,"links":[{"title":"Medium-Blogbeitrag","url":"https://medium.com/@martin-thissen/llama-alpaca-chatgpt-on-your-local-computer-tutorial-17adda704c23"}]},{"type":"subheader","crDate":1686645494996,"chDate":1686645506057,"text":"Perplexity"},{"type":"paragraph","crDate":1686650695574,"chDate":1686651309272,"text":"Perplexity ist ein weiteres LLM, das ähnlich funktioniert wie chatGPT. Tatsächlich basiert Peplexity auf GPT4.\nIm Gegensatz zu chatGPT liefert Perplexity  auch Links aus.\nDie Pro-Version kostet 20€ im Monat."},{"type":"links","crDate":1686651387759,"chDate":1686651387759,"links":[{"title":"Offizielle Seite","url":"https://www.perplexity.ai"}]},{"type":"subheader","crDate":1687262072247,"chDate":1687262128148,"text":"More to come ..."},{"type":"paragraph","crDate":1687262131650,"chDate":1687262517493,"text":"Der Markt der AI-Tools ist sehr bewegt und ständig erscheinen neue Tools.\nDie Zusammenfassung oben sollte keinesfalls als endgültig angesehen werden. Vielmehr ist sie nur ein Anfang. \nFür bestimmte Zwecke (SEO, Copywriting, Legal Texts, Blog, Produktpräsentation, etc.) gibt es spezialisierte Tools. \nUm eine Übersicht zu behalten gibt es wiederum Tools, die Du gern nutzen solltest, um auf dem Laufenden zu bleiben."},{"type":"links","crDate":1687262520505,"chDate":1687262520505,"links":[{"title":"There's an AI for that","url":"https://theresanaiforthat.com/"},{"title":"Futuretools","url":"https://www.futuretools.io/"}]}]}