{"content":[{"type":"paragraph","crDate":1686640207835,"chDate":1748246380728,"text":"Large Language Models (<i>LLM</i>) sind Programme, die darauf ausgelegt sind auf Anfragen in Klartext eine Antwort zu liefern. \nDie Anfrage kann auch die Erstellung von Programmcode sowie die Suche nach Fehlern in verschiedenen Sprachen sein.\nDamit lässt sich schon einiges anfangen und kleine bis mittelgroße Funktionen erstellen. Ein vollständiges Projekt oder mehrere zusammenhängende Funktionen aber setzen ein tieferes Verständnis voraus, das ein webbasiertes LLM kaum haben kann.\nÜbrigens verstehen die meisten LLM auch deutsch.\nDie bekanntesten LLM sind:"},{"type":"subheader","crDate":1686642085154,"chDate":1748247457628,"text":"ChatGPT (OpenAI)"},{"type":"paragraph","crDate":1686642093913,"chDate":1748247475965,"text":"ChatGPT ist mit 300 Millionen wöchentlich aktiven Nutzern das mit Abstand bekannteste und meistgenutzte LLM weltweit. Der Fokus liegt auf der breiten Anwendbarkeit für Privatnutzer und Unternehmen, wobei besonders die Multimodalität (Text, Bilder, Code) und die hohe Qualität der Antworten hervorstechen. Das günstigste Bezahl-Abonnement \"ChatGPT Plus\" kostet 20 Dollar pro Monat und bietet Zugang zu den fortgeschrittenen GPT-4 Modellen sowie schnelleren Antwortzeiten."},{"type":"links","crDate":1686642116680,"chDate":1686642116680,"links":[{"title":"Offizielle Webseite","url":"https://www.openai.com/chatgpt"}]},{"type":"subheader","crDate":1693482611123,"chDate":1748247525393,"text":"Google Gemini"},{"type":"paragraph","crDate":1693482617417,"chDate":1748247538890,"text":"Google Gemini zeichnet sich besonders durch seine tiefe Integration in das Google-Ökosystem (Gmail, Docs, Search) aus und bietet herausragende multimodale Fähigkeiten bei der Verarbeitung von Text, Bildern, Audio und Video. Mit einer durchschnittlichen Leistung von etwa 80% gehört Gemini zu den leistungsfähigsten LLMs auf dem Markt. Der Einstiegspreis für den \"Advanced Plan\" liegt bei 19,99 Dollar pro Monat und bietet Zugang zum experimentellen 2.0 Pro Modell sowie erweiterte Recherchemöglichkeiten."},{"type":"links","crDate":1693482856825,"chDate":1693482856825,"links":[{"title":"Offizielle Webseite","url":"https://ai.google/gemini"}]},{"type":"subheader","crDate":1686643984086,"chDate":1748247644013,"text":"Claude (Anthropic)"},{"type":"paragraph","crDate":1686644001291,"chDate":1748247657942,"text":"Claude von Anthropic hebt sich durch seinen besonderen Fokus auf ethische KI und Sicherheit hervor, wobei das Modell für seine präzisen, faktentreuen Antworten und exzellente Kontextverarbeitung bekannt ist. Das LLM wird besonders für seine Stärken in den Bereichen Programmierung und strukturiertes Schreiben geschätzt. Der Einstiegspreis für Claude Pro liegt bei etwa 20 Dollar pro Monat."},{"type":"links","crDate":1686644990066,"chDate":1686644990066,"links":[{"title":"Offizielle Webseite","url":"https://www.anthropic.com/claude"}]},{"type":"subheader","crDate":1686645153494,"chDate":1748247700659,"text":"Perplexity AI"},{"type":"paragraph","crDate":1686645173755,"chDate":1748247715287,"text":"Perplexity AI hat sich als führende KI-Suchmaschine etabliert und hält einen Marktanteil von 6,3% im Bereich der generativen KI-Chatbots, mit einem beeindruckenden vierteljährlichen Nutzerwachstum von 10%. Der Fokus liegt auf der Bereitstellung präziser, quellenbasierter Antworten durch Echtzeit-Webzugriff und automatische Zitierung. Das günstigste Bezahl-Abonnement \"Pro\" kostet 20 Dollar pro Monat und bietet erweiterte Suchfunktionen und schnellere Antwortzeiten."},{"type":"links","crDate":1686645185210,"chDate":1686645185210,"links":[{"title":"Offizielle Webseite","url":"https://www.perplexity.ai/"}]},{"type":"subheader","crDate":1686645494996,"chDate":1748247771582,"text":"You.com"},{"type":"paragraph","crDate":1686650695574,"chDate":1748247786185,"text":"You.com kombiniert traditionelle Suchfunktionen mit KI-gestützten Assistenten und bietet dabei besondere Stärken in der Personalisierung und Datenschutzfreundlichkeit. Das System zeichnet sich durch seine multimodalen Antworten aus, die Diagramme, Bilder und Code-Snippets direkt in der Benutzeroberfläche darstellen. Der Pro-Plan kostet 14,99 Dollar pro Monat und bietet unbegrenztes Web-Browsing sowie erweiterte Analysemöglichkeiten."},{"type":"links","crDate":1686651387759,"chDate":1686651387759,"links":[{"title":"Offizielle Seite","url":"https://you.com/"}]},{"type":"subheader","crDate":1748247831221,"chDate":1748247851003,"text":"Microsoft Copilot (ehemals Bing Chat)"},{"type":"paragraph","crDate":1748247855159,"chDate":1748247865455,"text":"Microsoft Copilot ist tief in das Windows-Ökosystem integriert und hat im letzten Jahr über 40 Millionen neue Nutzer gewonnen. Der Fokus liegt auf der Kombination von traditioneller Websuche mit generativer KI, wodurch umfassende, chat-basierte Antworten mit direkten Quellenverweisen ermöglicht werden. Das günstigste kostenpflichtige Abonnement ist im Microsoft 365 Copilot-Paket enthalten."},{"type":"links","crDate":1748247869176,"chDate":1748247869176,"links":[{"title":"Offizielle Webseite","url":"https://www.microsoft.com/en-us/microsoft-365/copilot"}]},{"type":"subheader","crDate":1748247900060,"chDate":1748247916689,"text":"LLaMA (Meta)"},{"type":"paragraph","crDate":1748247918460,"chDate":1748247952897,"text":"LLaMA von Meta ist ein Open-Source-Modell, das sich besonders durch seine Effizienz und geringeren Ressourcenbedarf auszeichnet. Das Modell ist für die kommerzielle Nutzung freigegeben und wird häufig für Chatbots und Kundenservice-Systeme eingesetzt. Als Open-Source-Lösung fallen keine direkten Abonnementkosten an, jedoch müssen Nutzer die Infrastrukturkosten für den Betrieb selbst tragen."},{"type":"links","crDate":1748247956164,"chDate":1748247956164,"links":[{"title":"Offizielle Webseite","url":"https://ai.facebook.com/llama"}]},{"type":"subheader","crDate":1748247995775,"chDate":1748248033547,"text":"Gronk"},{"type":"paragraph","crDate":1748248034986,"chDate":1748248052128,"text":"Gronk ist ein aufstrebendes LLM, das speziell für die Unterstützung bei kreativen Schreibprojekten entwickelt wurde. Es zeichnet sich durch seine Fähigkeit aus, kontextualisierte und stilistisch vielfältige Texte zu generieren, die künstlerische und literarische Anforderungen erfüllen. Der Einstiegspreis für Gronk Pro beträgt 15 Dollar pro Monat und bietet erweiterte Funktionen für Autoren und Kreative."},{"type":"links","crDate":1748248056194,"chDate":1748248056194,"links":[{"title":"Offizielle Webseite","url":"https://gronk.ai/"}]},{"type":"subheader","crDate":1748248079946,"chDate":1748248093622,"text":"Deepseek"},{"type":"paragraph","crDate":1748248095581,"chDate":1748248108774,"text":"Deepseek ist ein spezialisiertes LLM, das sich auf die Verarbeitung und Analyse von wissenschaftlichen und technischen Daten konzentriert. Es bietet hervorragende Ergebnisse bei der Erstellung von Forschungsberichten und der Beantwortung komplexer Fachfragen. Die Preise beginnen bei 25 Dollar pro Monat für das \"Research Plan\", das Zugang zu speziellen Datenbanken und Analysetools bietet."},{"type":"links","crDate":1748248112736,"chDate":1748248112736,"links":[{"title":"Offizielle Webseite","url":"https://deepseek.ai/"}]},{"type":"subheader","crDate":1748248310112,"chDate":1748248312771,"text":"BLOOM (BigScience)"},{"type":"paragraph","crDate":1748248314636,"chDate":1748248327180,"text":"BLOOM ist ein Open-Source-LLM, das von einer internationalen Forschungsgruppe in Europa entwickelt wurde. Es wurde speziell für die Unterstützung von mehrsprachigen Anwendungen trainiert und kann in über 46 Sprachen generieren und verstehen. BLOOM ist besonders bemerkenswert, da es als Community-Projekt entstanden ist und auf Transparenz sowie Zusammenarbeit in der KI-Forschung setzt."},{"type":"links","crDate":1748248396832,"chDate":1748248396832,"links":[{"title":"Offizielle Webseite","url":"https://bigscience.huggingface.co/"}]},{"type":"subheader","crDate":1748248411750,"chDate":1748248425004,"text":"Aleph Alpha"},{"type":"paragraph","crDate":1748248427080,"chDate":1748248445763,"text":"Aleph Alpha ist ein deutsches Unternehmen, das sich auf die Entwicklung von LLMs spezialisiert hat. Ihr Modell, Luminous, bietet fortschrittliche Textgenerierungs- und Verstehensfähigkeiten und ist darauf ausgelegt, Texte in verschiedenen Anwendungsbereichen wie Marketing, Forschung und Kundenservice zu generieren. Aleph Alpha hat sich auch auf die Entwicklung von KI-Systemen konzentriert, die ethische Standards berücksichtigen."},{"type":"links","crDate":1748248380827,"chDate":1748248380827,"links":[{"title":"Offizielle Webseite","url":"https://aleph-alpha.com/"}]},{"type":"links","crDate":1748248451585,"chDate":1748248451585,"links":[]},{"type":"subheader","crDate":1687262072247,"chDate":1687262128148,"text":"More to come ..."},{"type":"paragraph","crDate":1687262131650,"chDate":1687262517493,"text":"Der Markt der AI-Tools ist sehr bewegt und ständig erscheinen neue Tools.\nDie Zusammenfassung oben sollte keinesfalls als endgültig angesehen werden. Vielmehr ist sie nur ein Anfang. \nFür bestimmte Zwecke (SEO, Copywriting, Legal Texts, Blog, Produktpräsentation, etc.) gibt es spezialisierte Tools. \nUm eine Übersicht zu behalten gibt es wiederum Tools, die Du gern nutzen solltest, um auf dem Laufenden zu bleiben."},{"type":"links","crDate":1687262520505,"chDate":1687262520505,"links":[{"title":"There's an AI for that","url":"https://theresanaiforthat.com/"},{"title":"Futuretools","url":"https://www.futuretools.io/"}]}]}