{"content":[{"type":"paragraph","crDate":1693313818714,"chDate":1703072773628,"text":"Der Begriff Routing beschreibt die <i>Navigation</i> auf einer Single Page Applcation.\nDie gesamte Navigation findet im Browser statt. Elemente werden ein- und ausgeblendet, anstatt neu vom Server geladen zu werden.\nDas macht die Reaktionszeit einer Webseite schneller und verbessert das Nutzererlebnis erheblich.\nAllerdings gaht es nicht mur um das Anzeigen von Inhalten, das Routing legt auch die Adresse in die Browserhistory und erlaubt es, einzelne Seiten über die URL (per Link oder Bookmark) aufzurufen."},{"type":"subheader","crDate":1703075243373,"chDate":1703075251691,"text":"react-router-dom"},{"type":"paragraph","crDate":1703075254404,"chDate":1703075665926,"text":"Da React modular aufgebaut ist, muss das Routing als eigenes Modul eingebunden werden.\nHier hat sich das Modul <i>react-router-dom</i> bewährt.\nNach der Installation werden die relevanten Komponenten aus dem Modul importiert."},{"type":"terminal","crDate":1703075670740,"chDate":1703075678890,"text":"npm i react-router-dom"},{"type":"code","crDate":1703075682707,"chDate":1703075704657,"text":"import { BrowserRouter, Routes, Route, Link } from 'react-router-dom';"},{"type":"paragraph","crDate":1703075796171,"chDate":1703076700942,"text":"Im JSX-Code wird dann mit der <i>BrowserRouter</i>-Komponente ein Bereich für das Routing eingerichtet. \nDer Wechsel der Inhalte findet nur innerhalb der BrowserRouter-Komponente statt. Elemente außerhalb der Komponente (Header, Footer, etc.) bleiben unverändert.\nDas Routing besteht aus zwei Bereichen: Die Navigation und die Routen.\n<b>Navigation</b>\nIn der <i>Navigation</i> werden die Links mithilfe der <i>Link</i>-Komponenten angelegt. Jeder Link erhält ein <i>to</i>-Attribut, mit dem der Link identifiziert werden kann.\n<b>Routing</b>\nDie <i>Routes</i>-Komponente enthält mehrere <i>Route</i>-Komponenten. Eine Route bezeichnet das Inhaltselement, das angezeigt werden soll. \nSie enthält ein <i>path</i>-Attribut, das denselben Inhalt hat wie das <i>to</i>-Attribut des Links, welcher die Route aktiviert.\nDazu kommt ein <i>element</i>-Attribut, das die Komponente beschreibt, welche hier angezeigt werden soll.\nWird nun ein Link angeklickt, dann wird die Route mit dem dazu passenden Path angezeigt."},{"type":"code","crDate":1703076459281,"chDate":1703076590199,"text":"&lt;header>\n &lt;h1>Routing&lt;/h1>\n&lt;/header>\n&lt;BrowserRouter>\n &lt;nav>\n  &lt;Link to='/'>Home&lt;/Link>\n  &lt;Link to='/contents'>Contents&lt;/Link>\n  &lt;Link to='/Impressum'>Impressum&lt;/Link>\n  &lt;Link to='/Datenschutz'>Datenschutz&lt;/Link>\n &lt;/nav>\n\n &lt;Routes>\n  &lt;Route path=\"/\" element={&lt;Home />} />\n  &lt;Route path=\"/contents\" element={&lt;Inhalte />} />\n  &lt;Route path=\"/Impressum\" element={&lt;Impressum />} />\n  &lt;Route path=\"/Datenschutz\" element={&lt;Datenschutz />} />\n &lt;/Routes>\n&lt;/BrowserRouter>\n\n&lt;footer>\n Auch der Footer liegt außerhalb des Routers und bleibt unverändert.\n&lt;/footer>"}]}