{"content":[{"type":"paragraph","crDate":1687862819911,"chDate":1706512731164,"text":"Node.js ist eine Plattform für die Entwicklung von serverseitiger Javascript-Programme. Node.js nutzt eine ereignisgesteuerte und nicht-blockierende I/O-Modell, um effiziente und skalierbare Anwendungen zu ermöglichen. Die Basis von Node.js ist die V8-JavaScript-Engine von Google, die auch im Chrome-Browser zum Einsatz kommt. Node.js ermöglicht es damit, den Javascript-Code außerhalb des Browsers ablaufen zu lassen und die damit einhergehenden Einschränkungen hinter sich zu lassen. \nDamit kann NodeJS auch auf der serverseitigen Ebene genutzt werden. \nDas Node.js-Ökosystem besteht aus verschiedenen Komponenten wie der Node.js-Laufzeitumgebung, dem Node Package Manager (NPM) und verschiedenen Modulen, die weitere Funktionalitäten bereitstellen und erweitern. Node.js nutzt außerdem den Asynchronous Module Definition (AMD) Standard zur Organisation von Code in separate Module, was die Wiederverwendbarkeit, Lesbarkeit und Wartbarkeit des Codes verbessert."},{"type":"subheader","crDate":1687865173031,"chDate":1687867854151,"text":"Leistung"},{"type":"paragraph","crDate":1687865175158,"chDate":1706513175932,"text":"NodeJS ist was die Anfragen angeht, ungefähr auf Augenhöhe mit PHP. Aufgrund des moderneren Event-basierten  Anfragenmanagements kommt NodeJS allerdings mit Anfragespitzen besser zurecht.\nWenn es allerdings um reine Geschwindigkeit in Highperformance-Umgebungen geht, sind andere Lösungen wie Java u.ä. eine bessere Wahl.\nNode ist eine etablierte, extrem flexible Lösung und wird u.a. eingesetzt von:\n<ul>\n<li>Paypal</li>\n<li>LinkedIn</li>\n<li>Yahoo</li>\n<li>Mozilla</li>\n<li>Netflix</li>\n<li>Uber</li>\n<li>eBay</li>\n<li>Medium</li>\n<li>NASA</li>\n<li>u.v.m.</li>\n</ul>    \n    \n    \n    \n    \n    \n\n    "},{"type":"subheader","crDate":1687865177238,"chDate":1687867883525,"text":"Microservice"},{"type":"paragraph","crDate":1687865179254,"chDate":1687867892451,"text":"Der Microservice-Charakter von Node.js ist ein großer Vorteil für die Wartungsfreundlichkeit. Wenn man eine Codebasis in kleine Teile aufteilen kann, ist sie einfacher zu warten als eine einzige aufgeblähte Codebasis."},{"type":"subheader","crDate":1687867869733,"chDate":1687867902347,"text":"Benutzerfreundlichkeit"},{"type":"paragraph","crDate":1687867871804,"chDate":1687867910106,"text":"Der Entwicklungsprozess von Webanwendungen kann durch die Microservice-Architektur von Node.js optimiert und beschleunigt werden, da sowohl im Frontend als auch im Backend eine einzige Programmiersprache verwendet werden kann und über NPM Millionen von Bibliotheken zur Verfügung stehen, die genau Ihren Entwicklungsanforderungen entsprechen."}]}