{"content":[{"type":"paragraph","crDate":1697638004756,"chDate":1714746054972,"text":"Ein häufiger Wunsch ist es, Dateien, die über ein <i>file</i>-Inputfield ausgewählt wurden, auf der Webseite anzuzeigen.\nDie Schwierigkeit dabei ist, dass die Pfade zu den Dateien im Client nicht ersichtlich sind / sein dürfen. Daher gibt es die Lösung, dass die Dateien in eine temporäre Datensammlung gelegt und von dort gelesen werden können.\nAus dem Grund kann auf die Originaldetei nicht zugegriffen werden. \nAllerdings können Dinge wie Dateiname, Dateigröße und Dateityp aus den temporären Daten ausgelesen werden.\nDas Input-Element trägt eine Eigenschaft namens <i>filelist</i>. Dieses enthält ein Array mit Objekten zu allen ausgewählten Dateien."},{"type":"code","crDate":1714746252856,"chDate":1714748271330,"text":"const handleChange = evt => {\n console.table([...evt.target.files]);\n}\n\nconst fileInput = document.querySelector('input[name=\"files\"]');\nfileInput.addEventListener('change', handleChange);\n"},{"type":"paragraph","crDate":1714747653745,"chDate":1714748231778,"text":"Falls Bilder ausgewählt werden, ist ein häufiger Wunsch, die Bilder zu sehen.\nDa die Bilder in einem temporären Speicherbereich liegen, können sie nicht so einfach aus dem Dateisystem geladen werden.\nDafür gibt es das <i>FileReader</i>-Objekt, das über den entsprechenden Constructor angelegt wird.\nDas fileReader-Objekt enthält die Methode <i>readAsDataURL()</i>, welche als Parameter das file-Objekt aus dem input-Feld bekommt. Das Bild wird aus dem temporären Speicher geladen und der Inhalt als Data-URL in ein Bild übergeben.\nDamit wird der Inhalt des Bildes angezeigt, ohne wirklich auf die Datei zugreifen zu müssen."},{"type":"code","crDate":1714748234877,"chDate":1714748399914,"text":"const handleChange = evt => {\n let files = [...evt.target.files];\n\n files.forEach(file => {\n  const reader = new FileReader();\n\n  reader.onload = evt => {\n   const image = document.createElement('img');\n   image.src = evt.target.result;\n   document.body.appendChild(image);\n  };\n\n  reader.readAsDataURL(file);\n })\n}\n\nconst fileInput = document.querySelector('input[name=\"files\"]');\nfileInput.addEventListener('change', handleChange);"}]}