{"content":[{"type":"paragraph","crDate":1710941852661,"chDate":1710942933264,"text":"Eine der spannendsten Fragen ist die nach dem Hosting. \nEine NodeJS-Anwendung braucht mehr Rechte als eine PHP-Anwendung und ist grundsätzlich anders strukturiert. Daher kann eine NodeJS-Anwendung auch nicht durch ein Standard-Hosting abgebildet werden.\nHier sollen eine handvoll Anbieter vorgestellt werden, bei denen NodeJS verwendet werden kann. \nDer Markt ist sehr bewegt und ich jede Angabe kann sich jederzeit ändern."},{"type":"subheader","crDate":1710942893559,"chDate":1710942900501,"text":"Managed Server"},{"type":"paragraph","crDate":1710943436944,"chDate":1710943520860,"text":"Ein Managed Server ist ein Server, der in die Struktur des Anbieters eingebettet ist. Hier werden die Scripte über eine Schnittstelle wie GIT hochgeladen und dusgeführt. Man mietet eine gewisse Leistung, die dann für den Server zur Verfügung gestellt wird."},{"type":"paragraph","crDate":1710943776093,"chDate":1710943962150,"text":"<b>DigitalOcean</b>\nDigitalOcean bietet eine breite Palette von Optionen für das Hosting von Node.js-Anwendungen, einschließlich Droplets, App Platform und Marketplace. Droplets sind virtuelle Linux-Maschinen, die eine flexible Infrastrukturkonfiguration ermöglichen, während die App Platform eine vollständig verwaltete Lösung für das Bauen, Skalieren und Bereitstellen von Anwendungen bietet "},{"type":"paragraph","crDate":1710943963588,"chDate":1710943986067,"text":"<b>Amazon Web Services (AWS)</b>\nAWS ermöglicht das Hosting von Node.js-Anwendungen mit hoher Verfügbarkeit über den AWS Elastic Beanstalk-Service. AWS bietet auch eine breite Palette von Cloud-Diensten, die für Node.js-Anwendungen geeignet sind "},{"type":"paragraph","crDate":1710943988505,"chDate":1710943996033,"text":"<b>Heroku</b>\nHeroku ist eine Cloud-Plattform, die eine einfache Bereitstellung von Node.js-Anwendungen ermöglicht. Heroku unterstützt eine Vielzahl von Programmiersprachen und Umgebungen, einschließlich Node.js"},{"type":"paragraph","crDate":1710944054643,"chDate":1710944147612,"text":"<b>Google Cloud Platform (GCP)</b>\nGCP ist auf Containerunterstützung, Analytik, Big Data und maschinelles Lernen spezialisiert und bietet mit dem Google Kubernetes Engine ein herausragendes Feature für das Hosting von Node.js-Anwendungen."},{"type":"paragraph","crDate":1710944157802,"chDate":1710944192886,"text":"<b>Microsoft Azure</b>\nAzure ist die Cloud-Plattform von Microsoft, die es Entwicklern ermöglicht, schnell leistungsstarke Websites und Webanwendungen zu erstellen, bereitzustellen und zu verwalten "},{"type":"paragraph","crDate":1710944169290,"chDate":1710944216334,"text":"<b>OVHcloud</b>\nOVHcloud bietet eine Hosting-Lösung, die speziell für die Verwendung von Systemen und Programmiersprachen wie Node.js, Python und PHP entwickelt wurde. OVHcloud legt Wert auf transparente Preise und die Datenhoheit innerhalb der EU."},{"type":"paragraph","crDate":1710944177392,"chDate":1710944301119,"text":"<b>Weitere Anbieter</b>\nAndere Anbieter, die NodeJS-Hosting anbieten, sind Mittwald, BlueHost, HostPapa, Glitch, Kamatera, FastComet, SiteGround, Render, Fly.io, Railway, Platform.sh, RedHat Openshift Online, ZEIT Now, Googiehost, InfinityFree und Hostinger."},{"type":"subheader","crDate":1710942872257,"chDate":1710942942934,"text":"Self Managed Server"},{"type":"paragraph","crDate":1710942938720,"chDate":1710945909970,"text":"Darunter versteht sich ein virtueller oder dedicated Server, der bei einem Hoster ins Netzwerk eingebunden ist. Meistens ist alles notwendige wie SCP, SSH und anderes schon vorinstalliert und es kann sofort mit der Installation von Software wie Node, einer Datenbank, etc begonnen werden.\nDas mit Abstand häufigste Betriebssystem ist Linux. Diese Systeme setzen natürlich ein gewisses Vorwissen voraus, da sie fast immer nur eine Terminaloberfläche bieten. \nEinige bieten zusätzliche Tools wie Plesk oder Horde.\nAchtung: Diese Liste zeigt natürlich nur einen kleinen Ausschnitt."},{"type":"paragraph","crDate":1710945433965,"chDate":1710945643175,"text":"<b>Hetzner Online GmbH</b>\nHetzner ist ein deutscher Anbieter, der für seine kostengünstigen virtuellen Server bekannt ist und erneuerbare Energien nutzt.\nHetzner bietet eine breite Palette von Hosting-Produkten, darunter Webhosting, dedizierte Server und VPS-Hosting.\n"},{"type":"paragraph","crDate":1710945444156,"chDate":1710945681138,"text":"<b>IONOS by 1&1</b>\nIONOS, ehemals ein Teil von 1&1, ist eine deutsche Cloud-Computing-Plattform, die typische Dienste wie virtuelle Server, VPC, verwaltete Datenbanken und Objektspeicher anbietet und erneuerbare Energien verwendet..\nIONOS ist für seine große Belegschaft und eine Vielzahl von Hosting-Services bekannt.\n\n    .\n"},{"type":"paragraph","crDate":1710945495676,"chDate":1710945727209,"text":"<b>netcup GmbH</b>\nNetcup GmbH bietet VPS mit verschiedenen Spezifikationen und Preisen an.\nDie Serverstandorte von netcup befinden sich in Nürnberg und Wien."},{"type":"paragraph","crDate":1710945508117,"chDate":1710945750201,"text":"<b>Contabo</b>\nContabo ist ein deutscher Hostanbieter mit günstigen Preisen und Rechenzentren weltweit."},{"type":"paragraph","crDate":1710945752943,"chDate":1710945760863,"text":"<b>Open Telekom Cloud</b>\nOpen Telekom Cloud ist eine Cloud-Computing-Plattform der Deutschen Telekom AG \n"},{"type":"paragraph","crDate":1710945519096,"chDate":1710945807400,"text":"<b>STACKIT</b>\nSTACKIT ist eine Cloud-Computing-Plattform der deutschen Einzelhandelsgruppe Schwarz Gruppe und bietet verwaltete Dienste wie Objektspeicher, Kubernetes, Blockspeicher und Datenbanken an."},{"type":"paragraph","crDate":1710945528991,"chDate":1710945831654,"text":"<b>VPS2day</b>\nVPS2day bietet High-Speed KVM VPS Server mit SSD-Geschwindigkeit und dedizierten Ressourcen.\nDie Serverstandorte umfassen Deutschland, Niederlande, England, Schweden, Rumänien, Schweiz, Estland, Spanien und die USA."},{"type":"paragraph","crDate":1710945539793,"chDate":1710945846404,"text":"<b>Leaseweb VPS</b>\nLeaseweb VPS ist das Produkt des niederländischen Cloud-Anbieters Leaseweb und bietet Server in Rechenzentren in Europa, Nordamerika, Asien und Australien an."}]}