{"content":[{"type":"paragraph","crDate":1692196144200,"chDate":1692196261927,"text":"Beim Bubbling handelt es sich um den Mechanismus, bei dem ein Ereignis von einem inneren Element zu den äußeren übergeordneten Elementen im DOM aufsteigt.\nWenn ein Ereignis in einem Element ausgelöst wird, wird es zunächst auf dem Ziel-Element verarbeitet und dann in Richtung des Wurzelelements des DOMs weitergeleitet. Das Ereignis durchläuft dabei nacheinander alle übergeordneten Elemente, bis es das Wurzelelement erreicht. Dieser Aufstiegsprozess wird als Bubbling bezeichnet."},{"type":"paragraph","crDate":1692196263478,"chDate":1692196264518,"text":"Das Bubbling hat zur Folge, dass Event-Handler nicht nur auf dem Ziel-Element, sondern auch auf dessen übergeordneten Elementen ausgelöst werden können. Wenn beispielsweise ein Klick-Ereignis in einem inneren Button-Element ausgelöst wird, können Event-Handler für das Klick-Ereignis sowohl auf dem Button-Element als auch auf seinen übergeordneten Elementen wie dem Formular oder dem Body-Element ausgelöst werden.\nDas Bubbling bietet Entwicklern die Möglichkeit, Ereignisse auf verschiedenen Ebenen des DOM-Baums zu verarbeiten und auf diese Weise eine bessere Strukturierung und Organisation des Event-Handlings zu erreichen. Es ermöglicht auch die Delegierung von Ereignisbehandlung an übergeordnete Elemente, was die Effizienz verbessern kann."},{"type":"subheader","crDate":1692196612149,"chDate":1692196721852,"text":"Capture"},{"type":"paragraph","crDate":1692196628356,"chDate":1692196990193,"text":"In der Eventbehandlung kann zwischen <i>Bubbling</i>- und <i>Capturing</i>-Modus unterschieden werden.\nIm Capture-Modus wird das Ereignis von den äußeren übergeordneten Elementen zum Ziel-Element hinabgeleitet. Das bedeutet, dass das Ereignis zuerst auf dem Wurzelelement des DOMs aufgerufen wird und dann schrittweise zu den inneren Elementen weitergeleitet wird, bis es das Ziel-Element erreicht.\nDer Capture-Modus wird durch das dritte Argument der addEventListener()-Methode oder durch das Options-Objekt aktiviert."},{"type":"code","crDate":1692197217385,"chDate":1692197678125,"text":"const handleEvent = evt => console.log(evt.currentTarget);\n\ndocument.querySelectorAll('*').forEach(el =>\n el.addEventListener('click', handleEvent) \n // -> &lt;section id=\"third\">\n // -> &lt;main>\n // -> &lt;body>\n // -> &lt;html lang=\"de\">\n\n // Alternative 1\n el.addEventListener('click', handleEvent, true) \n // -> &lt;html lang=\"de\">\n // -> &lt;body>\n // -> &lt;main>\n // -> &lt;section id=\"third\">\n\n // Alternative 2\n // el.addEventListener('click', handleEvent, { capture: true })\n \n)"}]}