{"content":[{"type":"subheader","crDate":1698042936912,"chDate":1698061559133,"text":"Bildgeneratoren (Rechte ungeklärt)"},{"type":"paragraph","crDate":1698042917739,"chDate":1698065069298,"text":"Diese Tools erzeugen Bilder auf Basis von Texteingaben. Es gibt viele solcher Tools und alle haben ihre individuellen Stärken und Schwächen.\nDie Generatoren werden mit Unmengen an Bildern gefüttert, anhand derer die KI \"lernt\", welche Begriffe wie zu interpretieren sind.\nAllen gemeinsam ist jedoch, dass sie (zum gegenwärtigen Zeitpunkt) mit Trainingsdaten arbeiten, deren Herkunft meist ungeklärt ist. Daher ist die Verwendung copyrightgeschützten Materials zum Training sehr wahrscheinlich. Welche Auswirkungen das auf dei Rechtssicherheit der erzeugten Bilder hat, ist gegenwärtig noch unklar.\n<ul>\n<li><b>Midjourney</b>\nDer Bildgenerator mit den z.Zt. besten Ergebnissen. Die Bilder können problemlos als Fotos genommen werden. Tatsächlich nutze ich Midjourney, um Mockups für T-Shirt Prints zu generieren.\nMidjourney funktioniert als Bot im Discord und man kann einen eigenen Discord-Server mit mit Midjourney verknüpfen.</li>\n<li><b>Leonardo</b>\nRelativ neuer Bildgenerator mit spannenden Funktionen wie Bilderweiterung u.m. Befindet sich noch in der Beta-Phase und es dauert einige Tage, bis der Zugriff erlaubt wird.</li>\n<li><b>Nightcafe</b>\nEin Bildgenerator mit einer sehr aktiven Community. Bilder können geteilt und beurteilt werden, Credits können verdient werden.\nNightcafe bietet verschiedene Algorithmen und sehr schöne Presets.</li>\n<li><b>Dall-E3<b>\nDall-E3 ist der Bildgenerator, der in chatGPT eingebunden wurde. Das Besondere daran ist, dass der Bildgenerator in ein LLM eingebunden wurde und damit Folgeanweisungen versteht.\n</li>\n</ul>"},{"type":"links","crDate":1686658084789,"chDate":1686658084789,"links":[{"title":"Midjourney","url":"https://www.midjourney.com"},{"title":"Midjourney auf Discord","url":"https://discord.com/channels/662267976984297473/952771221915840552"},{"title":"Leonardo","url":"https://app.leonardo.ai/auth/login"},{"title":"Nightcafe","url":"https://creator.nightcafe.studio/create"}]},{"type":"subheader","crDate":1698042921362,"chDate":1698061564756,"text":"Bildgeneratoren (Rechtssicher)"},{"type":"paragraph","crDate":1698042945488,"chDate":1698064928940,"text":"Während die obigen Tools rechtlich fragwürdig sind, haben sich einige Anbieter das Problem zu eigen gemacht und ihre KIs ausschließlich auf Basis von Bildern erzeugt, deren Rechte sie besitzen. Damit ist klar, dass auch die erzeugten Ergebnisse problemlos verwendet werden können.\n<ul>\n<li><b>Adobe Firefly</b>\nDurch die Übernahme von Fotolia durch Adobe vor einigen Jahren ist Adobe Stock einer der größten Stockbild-Anbieter geworden.\nDiese Auswahl von Bildern nutzt Adobe, um sein Tool namens Firefly zu trainiren. Dies ist dieselbe Technik, die auch in Photoshop verwendet wird, um Bereiche zu füllen.\n</li>\n<li><b>Shutterstock</b>\nAls großer Stockphoto-Anbieter kann auch Shutterstock seine KI mit den Bildern aus dem eigenen Datenpool trainieren.\n</li>\n</ul>"},{"type":"links","crDate":1698064338726,"chDate":1698064338726,"links":[{"title":"Adobe Firefly","url":"https://www.adobe.com/de/sensei/generative-ai/firefly.html"},{"title":"Shutterstock","url":"https://www.shutterstock.com/ai-image-generator"}]}]}