{"content":[{"type":"subheader","crDate":1684310830359,"chDate":1684310835196,"text":"Leicht zu erlernen"},{"type":"paragraph","crDate":1684310837732,"chDate":1684311016944,"text":"Trotz einiger Schwächen in der Syntax ist Javascript relativ leicht zu erlernen, da es mit seiner Fehlertolaranz und der Vielzahl an Möglichkeiten relativ schnell Ergebnisse liefert. Diese ersten Ergebnisse sind natürlich optimierbar, aber allein die Tatsache, dass es schnell funktioniert, hilft beim Erlernen."},{"type":"subheader","crDate":1684311054099,"chDate":1684311062525,"text":"Einbindung in HTML"},{"type":"paragraph","crDate":1684311052438,"chDate":1684311231895,"text":"Javascript ist die einzige Sprache, die sich einfach und problemlos mit HTML verknüpfen lässt. Microsofts Versuche aus den 1990er, mit ActiveX eine Alternative zu schaffen, ist gescheitert. \nHeute gibt es zwar einige Alternativen (Typescript, Coffeescript, etc.), die aber alle vor der Veröfentlichung zu normalem Javascript konvertiert werden müssen."},{"type":"subheader","crDate":1684311290291,"chDate":1684311310200,"text":"Flexibilität"},{"type":"paragraph","crDate":1684311312947,"chDate":1684312330050,"text":"Dank des Aufbaus von Javascript und der Möglichkeit, es relativ simpel mit anderer Software zu verknüpfen, kann JS in vielen verchiedenen Umgebungen eingesetzt werden. \n<ul>\n<li>Natürlich kann JS in Webseiten eingebunden werden</li>\n<li>JS kann sogar die HTML-Struktur ersetzen</li>\n<li>Mit NodeJS und DenoJS können Backend- und Serversysteme entwickelt werden</li>\n<li>Dank Frameworks wie ElectronJS kann mit JS auch eine Standalone-Desktop-App erzeugt werden</li>\n<li>Sogar im James Webb Space Telescope läuft ein wesentlicher Teil der Steuerungssoftware in Javascript</li>\n</ul>"},{"type":"subheader","crDate":1684312381300,"chDate":1684312392185,"text":"Riesige Entwickler:innen-Community"},{"type":"paragraph","crDate":1684312396092,"chDate":1684312501564,"text":"Javascript ist eines der beliebtesten (nach einigen Umfagen die beliebteste) Programmiersprache der Welt. Das bedeutet auch, dass es sehr viele Entwickler:inner gibt, die aktiv in der Comminity anderen helfen. "}]}