{"content":[{"type":"paragraph","crDate":1699540230818,"chDate":1699540278916,"text":"Javascript ist eine Programmiersprache, die ursprünglich von Brendan Eich bei Netscape Communications entwickelt wurde. Sie wurde erstmals 1995 in der Browser-Engine des Netscape Navigator 2.0 eingesetzt. Die Sprache wurde ursprünglich unter dem Namen LiveScript entwickelt, aber im Dezember 1995 in JavaScript umbenannt, um die Verbindung zu Suns <i>Java</i>-Plattform zu stärken."},{"type":"subheader","crDate":1699540286810,"chDate":1699540303804,"text":"Die ersten Jahre"},{"type":"paragraph","crDate":1699540305784,"chDate":1699540436368,"text":"In den ersten Jahren nach seiner Einführung wurde Javascript hauptsächlich für einfache Aufgaben wie das Ändern des Aussehens einer Webseite oder das Auslösen von Ereignissen verwendet. Die Sprache war noch relativ einfach und hatte einige Einschränkungen. So konnte sie beispielsweise nicht auf den DOM-Baum zugreifen, der die Struktur einer Webseite beschreibt.\nIm Laufe der Zeit wurde Javascript stetig weiterentwickelt. Mit der Einführung von JavaScript 1.1 im Jahr 1996 wurde der Zugriff auf den DOM-Baum hinzugefügt. Dies ermöglichte es Javascript-Entwicklern, komplexere Aufgaben auszuführen, wie z. B. das Hinzufügen neuer Inhalte zu einer Webseite oder das Ändern des Verhaltens eines Elements.\nIn den folgenden Jahren wurden weitere neue Funktionen und Verbesserungen hinzugefügt. So wurde mit JavaScript 1.2 im Jahr 1997 die Unterstützung für Klassen und Vererbung eingeführt. Mit JavaScript 1.3 im Jahr 1998 wurde die Unterstützung für Funktionen mit Parametern hinzugefügt."},{"type":"subheader","crDate":1699540579636,"chDate":1699540584629,"text":"ECMA"},{"type":"paragraph","crDate":1699540587741,"chDate":1725868070493,"text":"Um die Entwicklung von Javascript zu koordinieren und sicherzustellen, dass die Sprache auf allen Browsern einheitlich implementiert wird, wurde im Jahr 1997 die ECMAScript-Spezifikation entwickelt. Diese Spezifikation definiert die Syntax und Semantik von Javascript.\nIn unregelmäßigen Abständen wurden neue Versionen veröffentlicht, um Javascript mit den grundlegenden Möglichkeiten auszustatten.\nDas Jahr 2015 und das im selben Jahr veröffentlichte ECMAScript 6 wird allgemein als der Startpunkt moderner Javascript-Programmierung angesehen. Es wurden u.a. neue Techniken eingeführt wie:\n<ul>\n<li>Klassen</li>\n<li>Arrow-Funktionen</li>\n<li>let und const mit Block-Scope</li>\n<li>Module für Import/Export</li>\n</ul>\nSeit 2015 veröffentlicht die ECMA jedes Jahr im Juni eine neue Version, die seitdem einfach mit der Jahreszahl benannt werden.\nNeuerungen in der jeweiligen Version lassen sich mit einer Anfrage an eine Suchmaschine oder AI sehr einfach ermitteln."}]}