{"content":[{"type":"paragraph","crDate":1768475232256,"chDate":1768475552568,"text":"Beim Coden gibt es manchmal diese Momente, in denen alles wie von alleine geht. Man spürt das Fließen der Ideen, wie Dinge quasi von allein an die richtige Stelle kommen. Das ist der <i>Vibe</i>.\nDieser Vibe soll mithilfe von KI aufgegriffen und verfolgt werden.\nUnter <i>Vibe Coding</i> versteht man den kreativen Dialog zwischen Mensch und Maschine. \nMensch kommuniziert in natürlicher Sprache mit der KI, die dann die Ideen aufgreift und in Code verwandelt."},{"type":"paragraph","crDate":1768477271888,"chDate":1768479643627,"text":"Vibe Coding läuft im einfachsten Fall über die Weboberfläche eines LLM wie Mistral oder Claude.\nHier wird in normaler Sprache der Wunsch eingegeben. \nBitte beachte, dass hier auch Stilwünsche, Rollen, Umgebungen und mehr in den Prompt fließen sollten, damit das Ergebnis gut wird.\nZunächst schreibst Du den Code in einem Texteditor Deiner Wahl. Dieser ist in der Bearbeitung sicherer und einfacher."},{"type":"terminal","crDate":1768477649046,"chDate":1768481837825,"text":"Du bist ein erfahrener Webentwickler, der besonderes Augenmerk auf modernen, kompakten Code legt.\nDu arbeitest mit ES2023, bevorzugst Arrow-Funktionen, Modul-Syntax, Higher-Class-Methoden.\nEntwickle eine App, in der ein klassischer Endless Runner gespielt werden kann. \nDas Spiel läuft in der Draufsicht in einem Canvas. Minimalistisch und einfach.\nEin Hubschrauber wird von oben gezeigt, mit der Tastatur kann der Hubschrauber gedreht werden. \nEr fliegt beständig vorwärts und muss einer Straße folgen, die gelegentlich die Richtung ändert. \nDer Spieler sieht immer nur einen Ausschnitt, die Straße wird automatisch immer weiter generiert. \nFür jeden zurückgelegten Meter werden Punkte gezählt."},{"type":"paragraph","crDate":1768478027208,"chDate":1768479898628,"text":"Im zweiten Schritt kann dieser Prompt an die KI gegeben, um ihn zu verbessern und Fragen zu klären."},{"type":"terminal","crDate":1768480094316,"chDate":1768481817305,"text":"Ich habe diesen Prompt für ein neues Projekt. Ich plane, den Prototypen per Vibe Coding umzusetzen. \nVerbessere den Prompt und stelle mir Fragen bei Unklarheiten.\n\nDu bist ein erfahrener Webentwickler, der besonderes Augenmerk auf modernen, kompakten Code legt.\nDu arbeitest mit ES2023, bevorzugst Arrow-Funktionen, Modul-Syntax, Higher-Class-Methoden.\nEntwickle eine App, in der ein klassischer Endless Runner gespielt werden kann. Das Spiel läuft\nin der Draufsicht in einem Canvas. Minimalistisch und einfach.\nEin Hubschrauber wird von oben gezeigt, mit der Tastatur kann der Hubschrauber gedreht werden. \nEr fliegt beständig vorwärts und muss einer Straße folgen, die gelegentlich die Richtung ändert. \nDer Spieler sieht immer nur einen Ausschnitt, die Straße wird automatisch immer weiter generiert.\nFür jeden zurückgelegten Meter werden Punkte gezählt."},{"type":"paragraph","crDate":1768480591994,"chDate":1768481735344,"text":"Was folgt ist ein Vorschlag, der durch Anweisungen in natürlicher Sprache verfeinert werden kann.\nDas besondere an dieser Methode ist, dass wir in die Rolle eines Art Directors schlüpfen und die KI die eigentliche Arbeit machen lassen.\nIch habe das Projekt oben ausprobiert und es bedurfte einige Anpassung und Nacharbeit, um zu funktionieren.\nDaran sieht man, dass diese Technik für komplexe Projekte noch nicht (siehe changedate) wirklich geeignet ist."},{"type":"paragraph","crDate":1768475559710,"chDate":1768476923368,"text":"Vorteile\n<ul>\n<li><b>Schnelle Entwicklung</b>: Da nicht alle Details selbst ausgearbeitet werden müssen und die Recherche auf die KI ausgelagert wird, geht die Entwicklung mit Vibe Coding relativ schnell.</li>\n<li><b>Kein Vorwissen nötig</b>: Da die KI <i>best practices</i> bestimmt und den Weg zum Ziel recherchiert, muss man sich nicht mit dem Thema auskennen.</li>\n</ul>\n\nNachteile:\n<ul>\n<li><b>Kontrollverlust</b>: Da die KI den Code schreibt, wie sie will, gibt man die Kontrolle an den Code ab.</li>\n<li><b>Schlechter Code</b>: Das Ergebnis ist nicht immer wie gewünscht. Es lässt sich zwar nachträglich noch einiges fixen, aber aufgrund der Funktionsweise werden für verschiedene Problemstellungen verschiedene best practices verwendet. Das führt zu inkosistentem Code, der sich nur schwer weiter entwicklen lässt.</li>\n<li><b>Nichts Neues</b>: Da die KI nicht wirklich versteht, was sie tut sondern nur bestehende Problemlösungen nimmt, anpasst und verwendet, kann sie nicht wirklich etwas neues erfinden. So ist es einfach, den millionsten Bildslider zu entwerfen. Etwas vollkommen neues ist da viel schwerer.</li>\n<li><b>Komplexität</b>: KI hat seine Grenzen, was die Komplexität angeht. Relativ einfache Projekte lassen sich damit gut umsetzen. Doch komplexe Projekte sind noch zu viel für diese Technik.</li>\n</ul>"}]}