{
  "content": [
    {
      "type": "paragraph",
      "crDate": 1725868095984,
      "chDate": 1725868552147,
      "text": "Im Rahmen des Lehrganges bei Alfatraining wird Visual Studio Code (kurz: <i>VSCode</i>) von Microsoft als Standard-Editor verwendet.\nNatürlich kann für die Webentwicklung jeder beliebige Text-Editor verwendet werden, wie z.B. PHPStorm, Brackets oder auch Eclipse. Im Notfall tut es auch nano (im Linux Terminal) oder sogar der Windows Editor. VSCode ist allerdings ein guter Standard mit vielen fortgeschrittenen Funktionen. Es ist Open Source und kann auf jedem Betriebssystem mit einer grafischen Benutzeroberfläche verwendet werden.\nVSCode wird übrigens mit <a href=\"https://www.electronjs.org/\" target=\"_blank\">ElectronJS</a> entwickelt. Es ist also mit den üblichen Webtechnlogien HTML, CSS, JS/Typescript umgesetzt. Man könnte sagen, dass VSCode eigentlich nur eine Webseite ist."
    },
    {
      "type": "image",
      "crDate": 1725868681104,
      "chDate": 1725868681104,
      "filename": "6bd38305969a1c2be07fbbe00.JPG",
      "subtext": "Beispielhafte Webseite in Visual Studio Code"
    },
    {
      "type": "subheader",
      "crDate": 1725868737266,
      "chDate": 1725868741735,
      "text": "Installation"
    },
    {
      "type": "paragraph",
      "crDate": 1725868744608,
      "chDate": 1725869147726,
      "text": "Visual Studio Code kann für jedes gängige Betriebssystem kostenlos heruntergeladen und verwendet werden.\nDie Installation funktioniert auf dem für das jeweilige Betriebssytem üblichen Weg."
    },
    {
      "type": "subheader",
      "crDate": 1725869471867,
      "chDate": 1725869500733,
      "text": "Vorteile"
    },
    {
      "type": "paragraph",
      "crDate": 1725869479761,
      "chDate": 1725870099583,
      "text": "Visual Studio Code (VS Code) ist ein leistungsstarker und anpassbarer Code-Editor, der viele Vorteile bietet:\n<ul>\n<li><b>Kostenlos und Open Source</b><br>VS Code ist kostenlos und unter der MIT-Lizenz als Open-Source-Software verfügbar, was es für Entwickler zugänglich macht</li>\n<li><b>Viele Programmiersprachen</b><br>Der Editor unterstützt eine Vielzahl von Programmiersprachen wie C#, JavaScript, Python und viele mehr, was ihn vielseitig einsetzbar macht.</li>\n<li><b>Erweiterbarkeit</b><br>VS Code bietet eine breite Palette von Erweiterungen, die es den Benutzern ermöglichen, den Editor an ihre spezifischen Bedürfnisse anzupassen. Dies umfasst Plugins für zusätzliche Funktionen und Themes.</li>\n<li><b>Echtzeit-Feedback</b><br>Entwickler können Änderungen vornehmen und die Ergebnisse in Echtzeit sehen, was die Effizienz beim Programmieren erhöht.</li>\n<li><b>Integrierte Git-Unterstützung</b><br>VS Code hat eine eingebaute Unterstützung für Git, was die Versionskontrolle und Zusammenarbeit erleichtert</li>\n<li><b>Leichtgewichtig</b><br>Im Vergleich zu anderen IDEs wie Visual Studio hat VS Code eine kleinere Installationsgröße und ist schneller, was es ideal für schnelle Anpassungen und Debugging macht</li>\n</ul>"
    },
    {
      "type": "subheader",
      "crDate": 1725869504449,
      "chDate": 1725869508147,
      "text": "Nachteile"
    },
    {
      "type": "paragraph",
      "crDate": 1725869509736,
      "chDate": 1725870331303,
      "text": "Trotz seiner vielen Vorteile hat VS Code auch einige Nachteile:\n<ul>\n<li><b>Keine vollständige IDE</b><br>Obwohl VS Code viele Funktionen bietet, ist es in erster Linie ein Code-Editor und nicht eine vollwertige integrierte Entwicklungsumgebung (IDE). Für komplexere Projekte könnte eine vollständige IDE wie Visual Studio erforderlich sein</li>\n<li><b>Eingeschränkte Projektverwaltung</b><br>VS Code arbeitet nicht mit Projektdateien, sondern behandelt Ordner als Projekte. Dies kann für Entwickler, die an größeren Projekten arbeiten, weniger intuitiv sein.</li>\n<li><b>Abhängigkeit von Erweiterungen</b><br>Viele Funktionen, die in anderen IDEs standardmäßig vorhanden sind, müssen in VS Code durch Erweiterungen hinzugefügt werden, was zusätzliche Konfiguration erfordern kann.</li>\n<li><b>Leistungsprobleme bei großen Projekten</b><br>Bei sehr großen Projekten kann die Leistung von VS Code beeinträchtigt werden, insbesondere wenn viele Erweiterungen installiert sind</li>\n</ul>"
    }
  ]
}