{"content":[{"type":"paragraph","crDate":1759238377046,"chDate":1770813411393,"text":"Webentwicklung ist ein ständiges Abwägen zwischen Fragen der Einfachheit, SEO, Ladegeschwindigkeit, Modularität und Dutzenden weiteren Dingen.\nAuf diese Wünsche gibt es verschiedene Antworten: SSG (Static Site Generation), SSR (Server Side Rendering), CSR (Client Side Rendering) sind nur die wichtigsten.\nNextJS bietet ein System, das halbautomatisch die verschiedenen Techniken miteinander kombiniert:\n<ul>\n<li>Wann immer möglich (und das ist meistens) wird SSG verwendet.</li>\n<li>Dynamische Daten werden per SSR eingebunden.</li>\n<li>Interaktive Elemente (Buttons, Inputs, etc) werden auf dem Cient gerendert.</li>\n</ul>\nUm das zu erreichen, ist nextJS erstmal ein System, das einen mit der Komplexität zu erschlagen scheint. \nAber wenn man sich anfangs nur um die Punkte kümmert, die für die eigenen Wünsche relevant sind, bekommt man schon bald erste Ergebnisse."},{"type":"subheader","crDate":1759239826301,"chDate":1759239843195,"text":"Installation"},{"type":"paragraph","crDate":1759239845678,"chDate":1759239977932,"text":"Zur Installation von nextJS kann mit <i>npx</i> das Script <i>create-next-app</i> aufgerufen werden.\nDas Script ruft einen Wizard auf, der die wichtigsten Fragen stellt, um Informationen über das Projekt zu sammeln."},{"type":"terminal","crDate":1759240161662,"chDate":1770812974080,"text":"npx create-next-app myapp\n\n√ Would you like to use TypeScript? ... No / Yes\n√ Which linter would you like to use? » None\n√ Would you like to use Tailwind CSS? ... No / Yes\n√ Would you like your code inside a `src/` directory? ... No / Yes\n√ Would you like to use App Router? (recommended) ... No / Yes\n√ Would you like to use Turbopack? (recommended) ... No / Yes\n√ Would you like to customize the import alias (`@/*` by default)? ... No / Yes"},{"type":"subheader","crDate":1759323229560,"chDate":1759323234353,"text":"Skripte"},{"type":"paragraph","crDate":1759241789242,"chDate":1770891476836,"text":"Standardmäßig werden drei Scripte eingebunden:\n<ul><li><b>npm run dev: </b>Startet den Entwicklungsserver mit <i>Hot Reload</i>.</li>\n<li><b>npm run build</b>: Erzeugt die optimierte Version zur Veröffentlichung.</li>\n<li><b>npm run start: </b>Startet den Produktionsserver. Die vom <i>build</i>-Script erzeugten Dateien werden ausgeliefert.</li></ul>"}]}