{"content":[{"type":"paragraph","crDate":1693305897255,"chDate":1755253480319,"text":"Um mit der Entwicklung eines React-Projektes zu beginnen, stellt sich zunächst die Frage nach dem Start.\nDer pragmatischste Weg, React zu installieren ist ein dafür entwickeltes Modul.\nDerer gibt es recht viele, daher soll hier eine Übersicht über die wichtigsten Module helfen. \nJedes der Module unten hat einen anderen Schwerpunkt und es gibt gewisse Unterschiede in der Art, wie damit gearbeitet wird. \nAn der Verwendung von React selbst ändert sich aber nicht viel. Immer werden die Techniken verwendet, die in dieser Doku beschrieben werden."},{"type":"subheader","crDate":1693311284335,"chDate":1693311289095,"text":"NextJS"},{"type":"paragraph","crDate":1693311291166,"chDate":1693313491202,"text":"Ein Framework, das auf React basiert und die Entwicklung von serverseitig gerenderten Webanwendungen erleichtert. Es bietet eine einfache und effektive Möglichkeit, React-Komponenten für das Server-Side Rendering (SSR) zu verwenden.\nDas Framework wurde von Vercel entwickelt und ist bekannt für seine Leistung, Flexibilität und Benutzerfreundlichkeit. Next.js ermöglicht es Entwicklern, Webanwendungen zu erstellen, die sowohl serverseitig als auch clientseitig gerendert werden können. Dies bedeutet, dass die Inhalte sowohl auf dem Server als auch im Browser gerendert werden können, was zu einer besseren Leistung, SEO und Benutzererfahrung führt.\nNext.js bietet eine Vielzahl von Funktionen, darunter Routen- und Dateibasiertes Routing, automatisches Code-Splitting, Hot-Reload und eine integrierte API-Routing-Lösung. Es unterstützt auch eine Vielzahl von Datenquellen und Datenabfragemethoden, einschließlich GraphQL und REST."},{"type":"terminal","crDate":1693311410158,"chDate":1693311434796,"text":"npx create-next-app myapp\ncd myapp\nnpm run dev"},{"type":"links","crDate":1693308501566,"chDate":1693308501566,"links":[{"title":"nextJS","url":"https://nextjs.org"}]},{"type":"subheader","crDate":1693311330835,"chDate":1693311335162,"text":"Gatsby"},{"type":"paragraph","crDate":1693311351546,"chDate":1693311353019,"text":"Ein JavaScript-Framework zur Entwicklung von Webanwendungen und statischen Websites. Es basiert auf React und verwendet GraphQL für Datenabfragen. Gatsby ermöglicht es Entwicklern, schnell und effizient leistungsstarke Websites zu erstellen, die auf modernen Webtechnologien wie Server-Side Rendering (SSR) und Static Site Generation (SSG) basieren.\nDas Besondere an Gatsby ist, dass es statische HTML-Seiten generiert, die dann bei Bedarf dynamisch geladen und aktualisiert werden können. Dadurch können Websites mit Gatsby sehr schnell reagieren und eine bessere Benutzererfahrung bieten.\nGatsby bietet eine Vielzahl von Funktionen und Plugins, die Entwicklern helfen, ihre Websites zu optimieren und zu erweitern. Es unterstützt auch eine breite Palette von Datenquellen, darunter CMS-Systeme, Datenbanken und APIs."},{"type":"terminal","crDate":1693311377792,"chDate":1693311470425,"text":"npx gatsby new myapp\ncd myapp\ngatsby develop"},{"type":"links","crDate":1693311356138,"chDate":1693311356138,"links":[{"title":"Gatsby","url":"https://www.gatsbyjs.com/"}]}]}