{"content":[{"type":"paragraph","crDate":1687958502215,"chDate":1687960368729,"text":"Node hat bereits bei der Installation ein gewisse Zahl von Modulen vorinstalliert. \nDiese Module sind:\n<ul>\n<li><b>assert</b>: Stellt eine Reihe von Assertion-Tests bereit.</li>\n<li><b>buffer</b>: Zum Arbeiten mit binären Daten.</li>\n<li><b>child_process</b>: Zum Verwalten von untergeordneten Prozessen.</li>\n<li><b>cluster</b>: Erlaubt es, eine Gruppe von Node.js-Prozessen zu erstellen, die auf demselben Server laufen.</li>\n<li><b>console</b>: Zum Schreiben von synchronem und asynchronem Output für Konsolen.</li>\n<li><b>constants</b>: Definiert verschiedene Betriebssystem-spezifische Konstanten.</li>\n<li><b>crypto</b>: Stellt kryptographische Funktionalität bereit.</li>\n<li><b>dgram</b>: Implementiert UDP/Datagramm-Sockets.</li>\n<li><b>dns</b>: Zum Durchführen von DNS-Lookups und Namensauflösungsfunktionen.</li>\n<li><b>events</b>: Zum Arbeiten mit Events und EventListener.</li>\n<li><b>fs</b>: Zum Arbeiten mit dem Dateisystem.</li>\n<li><b>http</b>: Sine Reihe von HTTP-Client- und Server-Funktionen zur Verfügung.</li>\n<li><b>https</b>: Wie http, aber für HTTPS.</li>\n<li><b>net</b>: Zum Erstellen von Servern und Clients.</li>\n<li><b>os</b>: Stellt eine Reihe von Methoden bereit, die Betriebssystem-bezogene Utilitys liefern.</li>\n<li><b>path</b>: Zum Arbeiten mit Dateipfaden.</li>\n<li><b>process</b>: Zum Arbeiten mit Prozess-Objekten.</li>\n<li><b>punycode</b>: Ein veraltetes Modul, das noch zur Unterstützung von internationalen Domainnamen vorhanden ist.</li>\n<li><b>querystring</b>: Stellt Hilfsfunktionen zur Verarbeitung von Query Strings bereit.</li>\n<li><b>readline</b>: Eine Schnittstelle zum Lesen von Daten aus einem lesbarer Stream, eine Zeile zu einer Zeit.</li>\n<li><b>repl</b>: Stellt eine Read-Eval-Print Loop (REPL) Implementierung zur Verfügung.</li>\n<li><b>stream</b>: Stellt eine API für das Arbeiten mit Streaming-Daten bereit.</li>\n<li><b>string_decoder</b>: Zum Dekodieren von Buffer-Objekten in Strings.</li>\n<li><b>timers</b>: Zum Ausführen einer Funktion nach einer bestimmten Anzahl von Millisekunden.</li>\n<li><b>tls</b>: Zum Implementieren von TLS und SSL-Protokollen.</li>\n<li><b>tty</b>: Stellt die tty.ReadStream- und tty.WriteStream-Klassen zur Verfügung.</li>\n<li><b>url</b>: Stellt Methoden zur Verarbeitung und Auflösung von URLs bereit.</li>\n<li><b>util</b>: Bietet Zugriff auf Utility-Funktionen.</li>\n<li><b>v8</b>: Exponiert APIs, die spezifisch für die Version der V8 JavaScript-Engine sind, die in der Node.js-Instanz verwendet wird.</li>\n<li><b>vm</b>: Zum Kompilieren und Ausführen von JavaScript-Code.</li>\n<li><b>worker_threads</b>: Zum Verwenden von Worker-Threads.</li>\n<li><b>zlib</b>: Zum Komprimieren und Dekomprimieren von Dateien.</li>\n</ul>\nUm diese Module zu verwenden, können sie einfach in das Programm inkludiert werden."},{"type":"code","crDate":1687960259794,"chDate":1687960414882,"text":"// Als CommonJS-Modul\nconst fs = require('fs');"},{"type":"code","crDate":1687960419475,"chDate":1687960437699,"text":"// Als ES6-Modul\nimport fs from 'fs';"}]}