{"content":[{"type":"subheader","crDate":1683814576771,"chDate":1683814590226,"text":"Webassembly"},{"type":"paragraph","crDate":1683814593050,"chDate":1701443560850,"text":"Einbindung von verschiedenen Sprachen (z.B. C, C++, C#, Rust, Go, Swift, etc.) in den Browser über ein Binärformat\nMicrosoft bietet hier eine Library namens Blazor, um C# in eine Webseite einbindung zu können."},{"type":"links","crDate":1683814593050,"chDate":1683814604441,"links":[{"title":"Webseite","url":"https://webassembly.org/"},{"title":"Mozilla","url":"https://developer.mozilla.org/en-US/docs/WebAssembly"},{"title":"Blazor","url":"https://learn.microsoft.com/de-de/aspnet/core/blazor/?view=aspnetcore-8.0"}]},{"type":"subheader","crDate":1683814473035,"chDate":1684227011415,"text":"PHP (und andere serverseitige Sprachen)"},{"type":"paragraph","crDate":1683814486923,"chDate":1684145735100,"text":"PHP ist eine Script-Sprache, die auf dem Server ausgeführt wird. D.h., der Server bekommt eine Anfrage an ein solches PHP-Script. Das wird geladen und ausgeführt. Dann sendet das Script das Ergebnis an den Client, der es darstellt. \nEin wesentliche Nachteil von PHP ist, dass eine Änderung auf der Webseite immer einen kompletten Reload der Seite erfordert.\nEin anderer Nachteil ist, dass jede Bearbeitung eine Weile dauert, da die Anfrage an den Server gesendet und dort verarbeitet werden muss.\nDazu kommt, dass die verschiedenen Versionen PHP nicht unbedingt zueinander kompatibel sind. D.h,. dass bei einer Aktualisierung des Server mglw. die PHP-Scripte aktualisiert werden müssen."},{"type":"subheader","crDate":1684227025695,"chDate":1684227280917,"text":"Elm, Coffeescript, ClojureScript, u.v.m."},{"type":"paragraph","crDate":1684227031258,"chDate":1684227677057,"text":"Dabei handelt es sich nicht um eigenständige Programmiersprachen sondern um Sprachen, die zu Javascript-Code umgewandelt wird.\nDen Entwickler:innen wird eine besser Fehlerbehandlung, weniger Fehler, bessere Performance und ein angenehmeres Programmiererlebnis versprochen. Dazu muss ein Transpiler zur Entwicklung installiert werden. Dieser generiert dann den optimierten JS-Code."},{"type":"links","crDate":1684227042140,"chDate":1684227042140,"links":[{"title":"Elm","url":"https://elm-lang.org/"},{"title":"Coffeescript","url":"https://coffeescript.org/"},{"title":"clojurescript","url":"https://clojurescript.org/"}]},{"type":"subheader","crDate":1723037449554,"chDate":1723037453276,"text":"Typescript"},{"type":"paragraph","crDate":1723037461547,"chDate":1723037805918,"text":"Typescript ist ein sogenanntes Superset von Javascript. D.h., es bietet mehr Möglichkeiten als Javascript (Interfaces, harte Typisierung, u.a.). Die Meinungen zu Typescript gehen auseinander. Die einen sagen, Typescript erlaube besseren Code. Die anderen sagen, Typescript verkompliziere die Entwicklung unnötig..\nTypescript-Code wird zu Javascript transpiliert und auf der Webseite läuft dann normales Javascript."},{"type":"links","crDate":1723037867806,"chDate":1723037867806,"links":[{"title":"Offizielle Webseite","url":"https://www.typescriptlang.org/"}]},{"type":"subheader","crDate":1684227924256,"chDate":1684227953712,"text":"React, Angular, Vue, u.v.m."},{"type":"paragraph","crDate":1684227958320,"chDate":1684228166943,"text":"Hierbei handelt es sich um keine Alternativen zu Javascript sondern um Javascript-Frameworks zur Erstellung von Single-Pagern.\nD.h. das Framework beschleunigt das Erstellen von Webseiten, erfordert aber neben ausführlichen Kenntnissen in JS zusätzlich Kenntnisse über das Framework."}]}