{"content":[{"type":"paragraph","crDate":1698239033242,"chDate":1698239363356,"text":"Um mit Komponenten zu arbeiten, muss einige Vorarbeit geleistet werden. Unter anderem wird ein Transpiler benötigt, um aus den <i>vue</i>-Dateien <i>Browser-kompatible</i> Dateien zu generieren. Zu dem Zweck empfielt sich das Modul <i>@vue/cli</i>.\nHierbei handelt es sich um ein Modul, das unter anderem das Einrichten eine Vue-App ermöglicht.\nZu beachten ist, dass das Modul global installiert werden muss."},{"type":"terminal","crDate":1698239032107,"chDate":1698239378530,"text":"npm i @vue/cli"},{"type":"paragraph","crDate":1698239407231,"chDate":1698239783778,"text":"Nach der Installation steht im Terminal der Befehl <i>vue</i> zur Verfügung. \nEs kann sein, dass nach der Installation ein Neustart des Terminals notwendig ist.\nDas Programm vue wird mit einer Option von mehreren Optionen gestartet. Hier werden wir nur auf die Erstellung der App eingehen.\nDazu wird dem Programm die Option <i>create</i> gegeben und ein Name für das zu erzeugende Projekt."},{"type":"terminal","crDate":1698239734728,"chDate":1698239744087,"text":"vue create myapp"},{"type":"paragraph","crDate":1698239808669,"chDate":1698246036965,"text":"Dann startet ein Wizard, der den Benutzer durch eine Reihe von Fragen führt und daraufhin die notwendigen Ordner und Dateien anlegt, um eine Vue-App zu entwickeln."},{"type":"subheader","crDate":1698246136013,"chDate":1698246141596,"text":"Ergebnis"},{"type":"paragraph","crDate":1698246143629,"chDate":1698246451567,"text":"Nach der Ausführung des Wizards wurde ein Ordner mit dem gewünschten Namen angelegt.\nIn diesem liegen mehrere Dateien und Ordner, die man sich näher anschauen sollte.\nIm Terminal sollte nun in den Ordner gewechselt und der Entwicklungsserver gestartet werden."},{"type":"terminal","crDate":1698246426752,"chDate":1698246436775,"text":"cd myapp\nnpm run serve"},{"type":"paragraph","crDate":1698246445423,"chDate":1698246561890,"text":"Beim Start des Entwicklungsservers sollte die App automatisch kompiliert werden. Das dauert einige Sekunden.\nNach der Kompilierung bekommt der Benutzer angezeigt, über welche URL die Webseite geöffnet werden kann. Diese Adresse muss aus dem Terminal kopiert und in die Adressleiste des Browsers übertragen werden."},{"type":"terminal","crDate":1698246568239,"chDate":1698246717860,"text":"DONE  Compiled successfully in 4446ms         17:07:58\n\nApp running at:\n - Local:   http://localhost:8080/\n - Network: http://192.168.100.168:8080/\n\nNote that the development build is not optimized.\nTo create a production build, run npm run build."},{"type":"links","crDate":1698246273372,"chDate":1698246273372,"links":[{"title":"Modul auf npmjs.com","url":"https://www.npmjs.com/package/@vue/cli"}]}]}