{"content":[{"type":"paragraph","crDate":1730125334426,"chDate":1730126532700,"text":"Aufgrund der Komplexität und ungewohnten Herangehensweise der IndexedDB gibt es einige <i>Libraries</i> und <i>Wrapper</i>, die den Umgang damit erleichtern.\nDies ist eine Übersicht über die wichtigsten und beliebtesten Projekte."},{"type":"subheader","crDate":1730125691555,"chDate":1730125700269,"text":"Dexie.js"},{"type":"paragraph","crDate":1730125687893,"chDate":1730125705527,"text":"Ein minimalistischer Wrapper für IndexedDB, der den Entwicklungsprozess erheblich vereinfacht. Es bietet eine unkomplizierte API, die es einfacher macht, IndexedDB-Code zu schreiben und zu verwalten. Dexie.js behebt auch verschiedene Bugs in den Implementierungen von IndexedDB, was eine stabilere Benutzererfahrung gewährleistet."},{"type":"links","crDate":1730125748863,"chDate":1730125748863,"links":[{"title":"Offizielle Webseite","url":"https://dexie.org/"}]},{"type":"subheader","crDate":1730125805656,"chDate":1730125821521,"text":"JsStore"},{"type":"paragraph","crDate":1730125813806,"chDate":1730125843199,"text":"JsStore bietet eine <i>SQL-ähnliche</i> Syntax für die Interaktion mit IndexedDB, was es Entwicklern, die mit SQL vertraut sind, zugänglicher macht. Diese Bibliothek kombiniert Einfachheit mit fortgeschrittenen Funktionen und ermöglicht komplexe Abfragen und Operationen."},{"type":"links","crDate":1730125884546,"chDate":1730125884546,"links":[{"title":"Offizielle Webseite","url":"https://jsstore.net/"}]},{"type":"subheader","crDate":1730125922965,"chDate":1730125991618,"text":"PouchDB"},{"type":"paragraph","crDate":1730125935653,"chDate":1730126035797,"text":"PouchDB ist eine clientseitige Implementierung von <i>CouchDB</i>, die IndexedDB für die Speicherung nutzt. Sie ermöglicht Offline-Funktionalitäten und die Synchronisation mit CouchDB-Datenbanken, was sie ideal für Anwendungen macht, die nahtlos <i>offline</i> und online arbeiten müssen"},{"type":"links","crDate":1730126041988,"chDate":1730126041988,"links":[{"title":"Offizielle Webseite","url":"https://pouchdb.com/"}]},{"type":"subheader","crDate":1730126097538,"chDate":1730126120254,"text":"IDB"},{"type":"paragraph","crDate":1730126100472,"chDate":1730126159810,"text":"IDB ist eine leichtgewichtige Bibliothek, die die IndexedDB-API eng spiegelt, jedoch mit Verbesserungen in der Benutzerfreundlichkeit. Sie zielt darauf ab, die IndexedDB-API einfacher zu handhaben, während sie gleichzeitig die grundlegende Funktionalität beibehält."},{"type":"links","crDate":1730125857187,"chDate":1730125857187,"links":[{"title":"Github Link","url":"https://github.com/jakearchibald/idb"}]},{"type":"subheader","crDate":1730126262597,"chDate":1730126265374,"text":"idb-keyval"},{"type":"paragraph","crDate":1730126268154,"chDate":1730126284399,"text":"idb-keyval ist ein sehr kleiner, auf <i>Promises</i> basierender Schlüssel-Werte-Speicher, der auf IndexedDB basiert. Mit einer Größe von etwa 600 Bytes ist es für Einfachheit und Benutzerfreundlichkeit konzipiert, was es zu einer großartigen Wahl für Anwendungen macht, die eine grundlegende Schlüssel-Werte-Speicherung benötigen."},{"type":"links","crDate":1730126289870,"chDate":1730126289870,"links":[{"title":"Github","url":"https://github.com/jakearchibald/idb-keyval"}]},{"type":"subheader","crDate":1730126391676,"chDate":1730126395567,"text":"RxDB"},{"type":"paragraph","crDate":1730126397522,"chDate":1730126406279,"text":"RxDB ist eine NoSQL-Datenbank, die auf IndexedDB basiert. Sie unterstützt Funktionen wie Indizierung, Kompression und Replikation und fügt Funktionalitäten wie die Datenteilung über Tabs hinweg und Beobachtbarkeit hinzu, was sie für komplexe Anwendungen geeignet macht, die Echtzeit-Datenaktualisierungen erfordern."},{"type":"links","crDate":1730126419802,"chDate":1730126419802,"links":[{"title":"Offizielle Webseite","url":"https://rxdb.info/"}]}]}