{"content":[{"type":"paragraph","crDate":1731081503316,"chDate":1731081792027,"text":"<b>Achtung</b>: Die switch/case-Anweisung wird häufig als veraltet bezeichnet.\nDas sehe ich auch so, da die switch/case-Anweisung kein Scoping bietet wie eine if/else if/else-Struktur. \nWie in JS üblich, funktionieren diese Anweisungen auch weiterhin, sollten aber in einem neuen Projekt nicht mehr verwendet werden"},{"type":"paragraph","crDate":1704812718828,"chDate":1704812721700,"text":"Die <i>switch-case</i>-Anweisung in Javascript ermöglicht es, verschiedene Anweisungsblöcke auszuwählen, basierend auf dem Wert einer bestimmten Variable oder einem Ausdruck.\nDer Ausdruck in der switch-Anweisung wird einmal ausgewertet. Der Wert des Ausdrucks wird dann mit den Werten in den einzelnen Fällen (case) verglichen. Wenn eine Übereinstimmung gefunden wird, wird der zugehörige Anweisungsblock ausgeführt.\nDas break-Schlüsselwort wird verwendet, um die weitere Ausführung nach dem aktuellen Fall zu beenden und aus der switch-Anweisung herauszuspringen."},{"type":"code","crDate":1704812742401,"chDate":1704812749341,"text":"switch (Ausdruck) {\n case Wert1:\n  // Anweisungsblock 1\n break;\n case Wert2:\n  // Anweisungsblock 2\n  break;\n default:\n  // Anweisungsblock alternativ\n}"},{"type":"paragraph","crDate":1704812763377,"chDate":1704812765570,"text":"Da jeder Anweisungsblock mit einem <i>break</i> beendet werden muss, geschieht etwas interessantes, wenn das break weggelassen wird. \nDann wird nämlich einfach der nächste Anweisungsblock ausgeführt, auch wenn die Bedingung nicht zutrifft.\nAuf diese Weise lassen sich Bedingungen zusammenfassen wie in einer Oder-Verknüpfung."},{"type":"code","crDate":1704812777673,"chDate":1704812791505,"text":"let nname = prompt('Nachname:');\n\nswitch (nname) {\n case 'Meyer':\n case 'Meier':\n case 'Maier':\n case 'Mayer':\n  alert('Der Meier war für die Aufsicht zuständig.');\n  break;\n case 'Schmidt':\n case 'Schmitt':\n case 'Schmiedt':\n  alert('Metallverarbeitender Beruf.');\n  break;\n default:\n  alert('Anderer Name.');\n  break;\n }"}]}