{"content":[{"type":"paragraph","crDate":1698151137674,"chDate":1698156374594,"text":"Ein wesentlicher Zweck für die Verwendung von Git ist die Möglichkeit, Daten zu teilen. Das Teilen des Inhalts läuft üblicherweise über Webseiten wie gitHub, gitLab oder anderen. \nDer größte Anbieter ist fraglos gitHub. Im Rahmen der Dokumentation wird daher ausschließlich auf gitHub eingegangen.\nZur Verwendung muss ein kostenloser Account angelegt werden. \nGitHub bietet eine Reihe von Funktionen, die die Zusammenarbeit an Softwareprojekten erleichtern, darunter:\n<ul>\n<li><b>Repositorys:</b>\nGitHub bietet einen sicheren und zuverlässigen Ort zum Speichern und Hosten von Repositorys.</li>\n<li><b>Pull Requests:</b>\nPull Requests ermöglichen es Entwicklern, Änderungen an einem Repository zu teilen und Feedback von anderen zu erhalten.</li>\n<li><b>Issues:</b>\nIssues ermöglichen es Entwicklern, Probleme und Fehler zu verfolgen.</li>\n<li><b>Wikis:</b>\nWikis können verwendet werden, um Dokumentation und andere Informationen zu einem Projekt zu speichern.</li>\n<li><b>Code Review:</b>\nGitHub bietet Tools zum Durchführen von Code Reviews, um die Qualität des Codes zu verbessern.</li>\n<li><b>Hosting von Websites:</b>\nGitHub kann verwendet werden, um statische Websites zu hosten.</li>\n</ul>"},{"type":"links","crDate":1698154559724,"chDate":1698154559724,"links":[{"title":"gitHub","url":"https://github.com/"}]},{"type":"subheader","crDate":1698154648607,"chDate":1698154683985,"text":"Konzept"},{"type":"paragraph","crDate":1698154688686,"chDate":1698156858375,"text":"Ein Repository ist ein Verzeichnis, das von Git verwaltet wird. Es enthält alle Dateien und Verzeichnisse, die versioniert worden sind, sowie die Versionshistorie dieser Dateien.\nEs muss unterschieden werden zwischen den zwei Arten von Repositiories:\n<ul>\n<li><b>Local Repository</b>\nDie Daten auf dem lokalen Computer\n</li>\n<li><b>Remote Repository</b>\nDie Daten auf dem Server\n</li>\n</ul>\nUm einen Projekt auf gitHub zu laden braucht es mehrere Dinge:\n<ul>\n<li>Ein Local Repositiory muss initialisiert sein und mindestens ein Commit muss vorliegen.</li>\n<li>Ein Konto auf Github muss existieren und das Remote Repository muss angelegt sein</li>\n<li>Das Remote Repository muss im Local Repository bekannt sein.</li>\n<li>Ein Personal Access Token muss angelegt sein und bekannt sein</li>\n</ul>\nWenn alle diese Dinge gegeben sind, kann das aktuelle Commit in das Remote Repository hochgeladen werden."},{"type":"terminal","crDate":1698156861719,"chDate":1698157002581,"text":"git push remoteRepositoryName branchName\n\n// meistens:\ngit push origin master"},{"type":"paragraph","crDate":1698156938995,"chDate":1698157049162,"text":"Um Daten vom Remote Repository ins Local Repository zu laden, wird der pull-Befehl verwendet. Dieser prüft zunächst, ob die Daten auf dem Remote Repository neuer sind als die lokalen Daten. Falls ja, werden die Commits übertragen."},{"type":"terminal","crDate":1698157051722,"chDate":1698157080743,"text":"git pull remoteRepositoryName branchName\n\n// meistens:\ngit pull origin master"},{"type":"paragraph","crDate":1698160115103,"chDate":1698160351301,"text":"Falls einer der Befehle zum ersten Mal verwendet wird, muss die Eingabe der Personal Access Tokens (PAT) erfolgen. Dazu öffnet sich ein kleines Browser-Fenster.\nIn diesem Fenster wird der Button <i>Token</i> ausgewählt und der PAT in die Eingabe hineinkopiert. Nach einem Klick auf <i>OK</i> werden die Daten dann hoch- bzw. herunterkopiert.\nGit speichert den Token und eine erneute Eingabe sollte nicht mehr nötig sein."},{"type":"subheader","crDate":1698156755816,"chDate":1698157444197,"text":"Remote Repository"},{"type":"paragraph","crDate":1698157449517,"chDate":1698158332645,"text":"Nach dem Anlegen eines Remote Repository (das sollte jeder Benutzer allein hinbekommen) steht das Repository unter der URL zur Verfügung:\nhttp://github.com/username/repositoryName.git\nDie Domain (<i>http://github.com</i>) und die Endung (<i>.git</i>) sind immer dieselben.\n<ul>\n<li>Um das Remote Repository im Local Repository einzutragen, wird der <i>remote</i>-Befehl verwendet.</li>\n<li>Dann kommt <i>add</i>, weil ein Remote Repository hinzugefügt werden soll.</li>\n<li>Als nächstes wird dem Remote Repository ein <i>Name</i> gegeben. Üblicherweise wird der Name <i>origin</i> verwendet.</li>\n<li>Zuletzt wird die <i>URL</i> der Remote Repository angegeben (siehe oben).</li>\n</ul>"},{"type":"terminal","crDate":1698158366844,"chDate":1698158391003,"text":"git remote add origin http://github.com/username/repositoryName.git"},{"type":"subheader","crDate":1698158428232,"chDate":1698158504418,"text":"Personal Access Token"},{"type":"paragraph","crDate":1698158512316,"chDate":1698160085183,"text":"Statt mit Username/Passwort arbeitet gitHub mit einem sog. Personal Access Token (<i>PAT</i>). Dieser erlaubt eine einfachere und sehr genaue Zuweisung von Rechten an verschiedene Personen. \nUm ein PAT anzulegen mus recht tiel in die Settings navigiert werden:\n<ul>\n<li>Zunächst werden im <i>Persönlichen Menü</i> rechts im Viewport der <i>Settings</i>-Eintrag ausgewählt.</li>\n<li>In den sich dann öffnenden Settings wird nach unten gescrollt und der letzte Punkt im linken Menü (<i>Developer Settings</i>) ausgewählt.</li>\n<li>Im sich dann öffnenden Submenü wird <i>Personal Access Tokens</i> angeklickt und <i>Tokens (classic)</i> ausgewählt.</li>\n<li>Schließlich wird der Button <i>Generate New Token</i> angeklickt und <i>Generate New Token (classic)</i> ausgewählt.</li>\n<li>Dann wird das neue Token angelegt. Dem Token kann eine Notiz und ein Ablaufdatum gegeben werden.</li>\n<li>Unter den Scopes muss mindestens <i>repo</i> ausgewählt werden, um die Reposories managen zu können.</li>\n<li>Schließlich kann ganz unten mit <i>Generate Token</i> der Tokan angelegt werden.</li>\n</ul>\nIm nächsten Fenster wird der Token als Buchstaben-Zahlen-Folge angezeigt. (z.B. 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).\nACHTUNG: Dies ist das einzige Mal, dass der Token angezeigt wird. Er sollte sicher gespeichert werden, da er nicht wiederhergestellt werden kann.\nFalls er doch verloren geht, muss ein neuer angelegt werden."}]}