{"content":[{"type":"paragraph","crDate":1713356534862,"chDate":1713361250511,"text":"Mit dem Einzug von generativer KI in unsere Welt ist es zunehmend schwieriger, echte von erfundenen Inhalten zu unterscheiden. Daher gibt es Versuche, mit dieser Problematik umzugehen."},{"type":"subheader","crDate":1713361316538,"chDate":1713515615744,"text":"Initiativen"},{"type":"paragraph","crDate":1713361337326,"chDate":1713518262743,"text":"Um dem Verfall der Glaubwürdigkeit von Bildmaterial entgegenzuwirken, wurden Initiativen wie die CAI (Content Authenticity Initiative).oder die C2PA (Coalition for Content Provenance and Authenticity) gegründet. Gründungsmitglieder sind Adobe, BBC, Microsoft, The New York Times Co., Leica, Nikon, Truepic, Qualcomm und viele andere.\nDiese Initiativen stellen Open-Source-Werkzeuge bereit, um die Herkunft eines Medienelementes zu markieren.\nDas wichtigste Werkzeug ist eine neue Art von Metadaten, die <i>Content Credentials (CR)</i>. \nDiese Metadaten werden kryptografisch gegen Manipulation geschützt. Sie enthalten neben Daten wie Kameratyp, Objektiv, Verarbeitungssoftware und mehr auch spätere Verarbeitungsschritte, ob und wie KI zum Einsatz kam und mehr. \nSo kann nachvollzogen werden, wie das Bild entstand und verarbeitet wurde.\nContent Credentials gibt es schon eine Weile, die Umsetzung im Markt braucht natürlich ihre Zeit. Zur Zeit hat Adobe im Photoshop diese Funktion als Beta integriert, einige wenige Kameras (v.a. teure Profimodelle) unterstützen den Standard bereits nativ. Nikon, Sony und Canon haben bereits ebenfalls solche Modelle angekündigt (Stand 04/2024)."},{"type":"image","crDate":1713516163607,"chDate":1713516163607,"filename":"49cc38455def55ea2922a4d00.png","subtext":"Das Logo der CR-Metadaten","width":"200"},{"type":"links","crDate":1713361863261,"chDate":1713361863261,"links":[{"title":"Offizielle Webseite","url":"https://contentauthenticity.org/"}]},{"type":"subheader","crDate":1713517539683,"chDate":1713517545702,"text":"Andere Initiativen"},{"type":"paragraph","crDate":1713517548180,"chDate":1713517789547,"text":"Neben der CAI und C2PA gibt es noch weitere Initiativen von anderen Unternehmen und Organisationen, um mit dem Problem der schwindenen Glaubwürdigkeit umzugehen:\n<ul>\n<li><i>Google</i> hat ein eigenes Wasserzeigen namens GenAI eingeführt, das nicht entfernt werden kann.</li>\n<li><i>Twilio</i> hat ein eigenes Label entworfen, um die Verwendung von Daten nachzuverfolgen.</li>\n<li><i>BriaAI</i> bieten Methoden an, um ihre Bilder nachvervolgen zu können.</li>\n</ul>\n"}]}